{
    "version": "https://jsonfeed.org/version/1",
    "title": "treacherous.tech",
    "description": "",
    "home_page_url": "https://treacherous.tech",
    "feed_url": "https://treacherous.tech/feed.json",
    "user_comment": "",
    "author": {
        "name": "Yours Truly"
    },
    "items": [
        {
            "id": "https://treacherous.tech/mastodon.html",
            "url": "https://treacherous.tech/mastodon.html",
            "title": "Surviving the Fediverse on a Mastodon",
            "summary": "\"Why do good things never wanna stay? Some things you lose, some things you give away.\" — Sleater Kinney, Good Things Apologia: It takes me forever to start (let alone finish) a blog post anymore. And when I do&hellip;",
            "content_html": "<blockquote>\n<p>\"Why do good things never wanna stay? Some things you lose, some things you give away.\" <strong>— Sleater Kinney,</strong> <em>Good Things</em></p>\n</blockquote>\n<p><strong>Apologia:</strong> It takes me forever to start (let alone finish) a blog post anymore. And when I do it often ends up being a brain deluge. So if you're committed, settle in.</p>\n<p><strong>Tl;dr:</strong> Twitter was bought by a megalomaniac who seems hell bent on demolishing it to get out of a rotten business decision. A lot of users have opted to migrate over to a somewhat janky, open source decentralised social network called Mastodon.  It can be horrible, and it can also be kind of great. And it needs work by the user community themselves because there is no manager to call over to complain.</p>\n<p><strong>The Goods:</strong> <a href=\"#masto-hacks\">Tools, tricks and hacks to survive in the Fediverse.</a></p>\n<hr>\n<h3>A brief eulogy for what was lost</h3>\n<p>Unless you're not on the internet (and then not reading this) you've likely already seen more news than you ever wanted to about international billionaire Bond villain Elon Musk buying Twitter. In summary: Elon troll-offered to buy the popular, money-losing, flawed but functional website on the grounds that the woke media elite were censoring the racists too much... and something weird about bots. He then failed at back-tracking when shareholders saw their golden parachutes and took it seriously. He was forced to spend $44 billion on a thing not worth half of that. He is now dedicated to destroying it as fast as possible, throwing everything he can at the effort, including the sink he brought to the office with him. Every day some fresh new hell is revealed as more workers are sacked or quit, moderation is eviscerated, advertisers flee, glitches increase, and users keep wishing one another goodbye as though there's going to be some server meltdown any day.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/24/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-xs.jpg 300w ,https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-sm.jpg 480w ,https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-md.jpg 768w ,https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-lg.jpg 1024w ,https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-xl.jpg 1360w ,https://treacherous.tech/media/posts/24/responsive/nature-grass-bird-leaf-wildlife-green-488827-pxhere.com-2xl.jpg 1600w\"  alt=\"This is a picture of a very dead blue coloured bird.\" width=\"720\" height=\"480\">\n<figcaption >Photo of a dead, blue-coloured bird for editorial illustrative effect. The image is released free of copyrights under Creative Commons CC0. Via pxhere.com</figcaption>\n</figure>\n<p>Twitter is/was not the \"simple\" platform many people are lately alleging it is/was. It's complex. Those who thought real-names policies or \"just allow free speech\" or \"just show posts in chronological order\" were good ideas could never really comprehend the complexity of the platform, or the many users who relied on it. They never understood how it would impact politics, social issues, war even. They didn't consider or care about how even the smallest changes to the user interface or algorithm on such a large-scale social platform could throw thousands of at-risk users under the bus within minutes. There are other blog posts about all these things that I could but realistically won't write. Other people have and probably still are. Read them. Good by hell bird site. Maybe you live another day. Maybe a few after that. But the exodus has begun. Even if you linger, you are in Myspace territory. Effectively dead. Wishing you could die.</p>\n<h3>What comes next</h3>\n<p>Enough of all that. The web is essentially a network of sand mandalas. Eventually every platform goes away. This post is about what comes next. For now, that seems to be Mastodon, and the Fediverse. It too is a volatile mess, only in different and decentralised ways. For whatever problems Twitter had that Mastodon may fix, it introduces many others. While I'm encouraging people to give it a try, I'm not a tech optimist about it. I'm the opposite of that. I'm not a luddite, but I'm a pessimist. Every piece of technology ever created is minimally dual purpose, often more than duel. Some of those other purposes are to be weapons. Developers don't usually intend for their creations to be dangerous. But they don't get to decide that, either. They can only try to mitigate the risk of it. At the end of the day, your users will show you the real purpose of what you've built. In social web development, our Dr. Frankenstein doesn't create monsters. He creates what monsters like most: Something that attracts their prey.</p>\n<p>Wait, it's getting too dark again. Sorry, I do that. Things are good. We're going to talk about happy stuff. Free, open source, non-capitalist, community driven software, with no algorithms, no corporate incentives to commodify your data, no creepy labour law violations, and no weird crypto-fascist platform owners with cults of trolls harassing anyone who speaks up. It's all as pure as hugs and puppies or rainbows and unicorns. Or something. </p>\n<p>Mastodon, unlike Twitter, isn't a centralised service provider. It's free open-source software. Anyone can host their own Mastodon platform and publish content on it. They can choose to let others register on their platform to do likewise. If you run your own Mastodon, you can set your own moderation policies, your own rules for everything. Anyone on your Mastodon can also follow or interact with other users on other Mastodon platforms hosted elsewhere. This is because Mastodon runs on <a href=\"https://www.w3.org/TR/activitypub/\" target=\"_blank\" rel=\"noopener noreferrer\">W3C's ActivityPub protocol</a>. ActivityPub essentially creates a federation of websites, or the \"Fediverse\" as its fans call it. If you host your own Mastodon, you can choose which other Mastodons your platform federates with, limits or blocks. So, you can rule over your users, but you can't rule over users on another Mastodon. You can already possibly spot the upsides of all of this, and I'll bet you can already see some obvious downsides.</p>\n<pre><strong>Note:</strong> Before we get much further, I want to warn you, dear reader, that while Tweeters \"tweet,\" Mastodon users \"toot.\" As a result, I occasionally may say something like \"she tooted.\" It's not my fault, it's the verb for posting there. Life is trade-offs.</pre>\n<p>I created my account on <a href=\"https://mastodon.social\" target=\"_blank\" rel=\"noopener noreferrer\">Mastodon.Social</a> back in 2017. It was neat. I saw some things in the user interface I liked, and other things that were curious, or not intuitive if you're used to a commercial service provider that pays developers a lot of money. But mostly I was only ever a light user because hardly anyone else was there. I'd left Facebook by then, had killed my Reddit account, and even back then people were thinking Twitter's days were numbered. That was due to a lot of weird decisions by Jack's Twitter. Now Elon has made a lot of Twitter users miss Jack in the way Mark's Facebook eventually made people miss Tom's Myspace. And yet they don't go back to Myspace. It's still there. Pointlessly there. We look to the past through rose-tinted glasses.</p>\n<p>But I digress. Now people are fleeing the dying bird site, and the decentralised federation of platforms named after an extinct elephant is being resurrected with hundreds of thousands — if not millions — of joiners. In this post I want to explore how a user can survive in the Fediverse, and maybe even enjoy it. High hopes.</p>\n<h3>Here we start some notes in less of a particular order</h3>\n<p>Sorry, dear reader. I wish this section was more coherently organised but there's a reason that \"blog\" is a word that sounds like its definition should be \"text vomit.\" My thoughts are as decentralised at the Fediverse. And with that...</p>\n<p>Let's look at rules! Mastodon is decentralised, as we've already covered. This greatly reduces what I call \"The Erratic billionaire Man Baby Threat.\" No one single egotistical maniac can easily kill the whole thing. If Twitter was a Mastodon platform, it could go nuclear, and people could (relatively) easily jettison to another one while it crashes. However, in that dictator's place, with Mastodon we can have a series of petty tyrants overseeing their own fiefdoms (and a number of benevolent chieftains, too).  Remember, every Mastodon administrator can set their own terms of use and moderation policies. The one I'm on is <a href=\"https://mastodon.social/@aiefel\">mastodon.social</a>. It is hosted and maintained by the German nonprofit, <a href=\"https://joinmastodon.org/about\" target=\"_blank\" rel=\"noopener noreferrer\">Mastodon gGmbH,</a> which creates and oversees the open source Mastodon software itself. Check out its \"<a href=\"https://mastodon.social/about\" target=\"_blank\" rel=\"noopener noreferrer\">About page</a>,\" and look at two areas: \"<strong>Server Rules</strong>,\" and \"<strong>Moderated Servers</strong>.\" I have concerns about whether I should stay on this Mastodon, but we'll get to those somewhere further down your scroll bar.</p>\n<pre><strong>Side note:</strong> Mastodon lingo uses the word \"server\" a lot. Most people don't really think about servers, and why would they? Essentially a server is just the computer that is delivering you a website. (Of course, it's more complicated than that, but also not really.) When you join a Mastodon, your data is on the server hosting it. <strong>Server = some other person's machine.</strong> Their house; their rules. Some people call them \"instances\" instead. I just call them Mastodons. I'm on a Mastodon, you're on a Mastodon, we're on Mastodons. Maybe we're on the same one, maybe not. Maybe they're federated with one another, maybe they aren't. But Mastodon is made by software engineers. This creates certain linguistic challenges and learning curves for users that don't seem necessary to me. Mastodon gGmbH should fix this. Get humans who can explain things to the other humans to name everything. Words mean things, use them correctly.</pre>\n<p><strong>SERVER RULES:</strong> These are useful as one way of determining if a Mastodon is right for you. Looking across different ones is also educational, because you get an idea of how different they can be from one another. Server rules are often both the terms of service and moderation policies. When I think of server rules, I tend to think of firewall policies, or how port forwarding might be set up. But these Mastodon server rules are supposed to be about how humans use a particular Mastodon platform that they've joined.</p>\n<p>There are <a href=\"https://docs.joinmastodon.org/admin/moderation/#individual-moderation\" target=\"_blank\" rel=\"noopener noreferrer\">a few different levels of penalties</a> for bad users. Mostly it seems administrators just choose the ban hammer of \"suspension\", though. Also note: there's sometimes a gap between the published rules and how things really work. Mastodon doesn't solve the moderation problem; it shifts it and creates strange new quandaries. Instead of the central dictator, you have fiefdoms, some with their petty tyrants, others with inconsistent or corrupt cops, and many seemingly with no sheriff in town at all. We'll get back to that.</p>\n<p><strong>MODERATED SERVERS:</strong> Another useful piece of information you can find on a Mastodon's \"About Page\" is its list of \"moderated servers.\" These are the other Mastodons that this Mastodon is either limiting access to or blocking. If a Mastodon admin decides they don't like how another Mastodon behaves itself, they have <a href=\"https://docs.joinmastodon.org/admin/moderation/#server-wide-moderation\" target=\"_blank\" rel=\"noopener noreferrer\">three options to deal with it:</a></p>\n<ol>\n<li>They can just \"reject media,\" and then users of their Mastodon won't see any media, images or files from users of the other one, just the text data.</li>\n<li>They could \"limit\" activity, which means unless their users are following specific accounts, they won't see anything of the other Mastodon.</li>\n<li>Or they can suspend the other Mastodon, meaning no interactivity is possible between the two. Sort of like how a Facebook user can't follow a Twitter account. It's again, another bad naming convention. It's essentially a Mastodon blocklist.</li>\n</ol>\n<p>Looking at which other Mastodons a Mastodon blocks can let you know what they don't really like to see there. With enough Mastodons blocking others, the Fediverse conceivably falls apart. This calls into question whether we really have a federation or an emerging set of disjointed Bantustans. No one wants a Bantuverse.</p>\n<p><strong>OTHER BITS AND PIECES:</strong> There are also other items a Mastodon administrator may want to include, mostly to keep themselves out of legal hot water, but their presence or absence can be a signal about how well it's being managed. I won't go into all the legal aspects of running a DIY social network, but from a legal perspective, anyone doing it is just as liable for what happens as a Twitter or Facebook would be. mom-and-pop shops are at a real disadvantage. For more on that, here's \"<a href=\"https://denise.dreamwidth.org/91757.html\" target=\"_blank\" rel=\"noopener noreferrer\">A guide to potential liability pitfalls for people running a Mastodon instance</a>.\" Read that. A few of key take-aways someone that wants to run their own social network that anyone can join:</p>\n<ul>\n<li>Let your Mastodon be owned by an LLC, or some other legal entity that can take the hit for you if/when things go wrong, and have that information published on the site.</li>\n<li>Have a privacy policy and other text on complying with various relevant regulations, not just in the jurisdiction where the Mastodon is hosted, but where it may be accessible (GDPR and the like). <a href=\"https://blog.riemann.cc/projects/mastodon-privacy-policy-generator/\" target=\"_blank\" rel=\"noopener noreferrer\">There's a privacy policy generator for that;</a></li>\n<li>Have a DMCA Registration Number, published on your Mastodon, and a link to a take-down request form for people to report copyright violations;</li>\n<li>And much, much more (really, read the above link.)</li>\n</ul>\n<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  src=\"https://treacherous.tech/media/posts/24/switter-love.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/switter-love-xs.png 300w ,https://treacherous.tech/media/posts/24/responsive/switter-love-sm.png 480w ,https://treacherous.tech/media/posts/24/responsive/switter-love-md.png 768w ,https://treacherous.tech/media/posts/24/responsive/switter-love-lg.png 1024w ,https://treacherous.tech/media/posts/24/responsive/switter-love-xl.png 1360w ,https://treacherous.tech/media/posts/24/responsive/switter-love-2xl.png 1600w\"  alt=\"Switter logo\" width=\"728\" height=\"168\"></figure>\n<p>Jurisdiction and legislation are important factor in all of this, and there's no better example of this than Switter, which was a Mastodon we could now call a central cautionary tale from the Fediverse's own secret history. Few may even know it existed. It was an excellently moderated and maintained social media space for sex workers that used Mastodon as its platform. On it, you could find all kinds of stories about life as experienced by sex workers. They were funny, sad, and sometimes horrific. It was honest.</p>\n<p>But <a href=\"https://www.theverge.com/2018/4/19/17256370/switter-cloudflare-sex-workers-banned\" target=\"_blank\" rel=\"noopener noreferrer\">it was constantly under attack</a>. U.S. legislation aimed against sex workers under the guise of \"stopping sex trafficking\" meant Switter couldn't use Cloudflare, which is U.S. based. Other new laws came in or were on the way in the U.S., UK, Australia and elsewhere that essentially rendered Switter illegal in many jurisdictions and its administrators and users could be held criminally liable for speech that should really not be criminalised in any liberal democracy. It finally had to close in March, 2022. <a href=\"https://switter.at/\" target=\"_blank\" rel=\"noopener noreferrer\">Here's a memorial site in its memory</a>. </p>\n<p>There are a lot of escort websites on the web for anyone who wants to hire a sex worker. They're owned by companies, charge commissions and navigate different legal structures. What's hard to keep legal is the friendly, social platform that let sex workers present themselves however they wanted. RIP Switter. It had good moderation practices and Terms of Service,  but that wasn't enough.</p>\n<p>As of this writing, are about 2.6 million monthly active users across 8k online Mastodon servers, <a href=\"https://joinmastodon.org/about\" target=\"_blank\" rel=\"noopener noreferrer\">according to Mastodon gGmbH</a>. Let's assess some of their policy pages (\"About\" pages). For our purposes, we'll use a small list. Check out the polices and practices for:</p>\n<ul>\n<li><a href=\"https://mastodon.social/about\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><strong>Mastodon.Social</strong></a><strong>:</strong> General purpose. Run by a friendly looking European nonprofit that also happens to develop Mastodon. It probably wants to showcase a sort of best practices way of doing things. That said, it has a limited \"about\" page. No information on the active user count. Mostly reasonable, if brief, content policies.  Very explicit \"<span class=\"rules-list__text\">No content illegal in Germany.\"  At least we know what jurisdiction we're talking about, many Mastodons' \"About\" pages don't mention it. A large listing of both limited and suspended Mastodons, and each has a line underneath explaining why.</span></li>\n<li><a href=\"https://infosec.exchange/about\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Infosec.Exchange</strong></a><strong>:</strong> I know more people on this one than most of the others including the Mastodon I'm on. It's a diverse group of digital security experts, the majority of whom take user safety seriously, and will probably want their Mastodon site to do likewise. It has 32k active users (impressive). 10 items on the content policy, which seems to be above the norm. Interesting 10th one (but relevant for the community here) calling for \"No attacks against (or from) the instance.\" Essentially don't hack it. (I don't know that many adversarial hackers follow as platform's ToS, but at least it's asking for no friendly fire. Quite a growing list of suspended Mastodons and only a few limited ones. Controversially, the journalism Mastodon Journa.Host, is limited due to \"handling of anti-trans situation.\" Yes, anti-trans people can just go to hell, but I'm not sure what they're getting at regarding \"the situation.\" Many other suspended Mastodons listed don't have reasons listed for them.</li>\n<li><a href=\"https://octodon.social/about\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Octodon.Social</strong></a><strong>:</strong> Seems like a one-person operation. It has 2k active users. In place of a policy there is a disjointed manifesto of sorts with some tough talk in it. Interesting line: \"if you betray me, you will be thrown overboard.\"  Lots and lots of limited or suspended servers, no reason given for any. Sketchy.<br><a href=\"https://mastodon.lawprofs.org/about\" target=\"_blank\" rel=\"noopener noreferrer\"></a></li>\n<li><a href=\"https://mastodon.lawprofs.org/about\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Mastodon.Lawprofs.Org</strong></a><strong>:</strong> Set up for legal experts, so we may expect some policies to match the profession. Has 233 active users. Enjoy that there's a depiction of one of the famed pig trials from the Europe's Middle Ages.  There is a DMCA Registration Number and associated take-down request form. Just 5 fairly brief but widely-encompassing content policy rules. Includes \"No content unlawful in the United States or the State of New York.\" Was expecting more legal verbiage.</li>\n<li><a href=\"https://journa.host/about\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Journa.Host</strong></a><strong>:</strong> Set up for journalists, and has 2.3k of them so far. It has a 501c3 nonprofit hosting it, a DMCA Registration Number and form, and a form for people to apply to join in order to confirm each user is somehow related to the journalistic field. It lists its moderators, which is a first I've seen. It has six straight-forward content policies. Number 2 includes proscribing transphobia, so considering Infosec.Exchange's concerns mentioned already, one is left wondering what may be up.  Moderation is hard. No information is listed whether any other Mastodons are limited or suspended.<br><a href=\"https://mastodon.mit.edu/about\" target=\"_blank\" rel=\"noopener noreferrer\"></a></li>\n<li><a href=\"https://mastodon.mit.edu/about\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Mastodon.MIT.edu</strong></a><strong>:</strong>  Hosted and managed by the university. 280 active users. Limited to MIT related accounts. Content guidelines are under the \"about\" section, not the \"server rules\" section, but they are as comprehensive as you'd expect. No information on limited or suspended servers.</li>\n</ul>\n<pre><strong>NOTE:</strong> I think it's important to acknowledge that Mastodon gGmbH does publish a \"<a href=\"https://joinmastodon.org/covenant\" target=\"_blank\" rel=\"noopener noreferrer\">Server Covenant</a>\" which includes a kind of limited, basic set of best practices. <strong>These are:</strong><br><br>1. Active moderation against racism, sexism, homophobia, and transphobia;<br>2. Daily backups;<br>3. At least one other person with emergency access to the server infrastructure;<br>4. Commitment to give users at least 3 months of advance warning in case of shutting down;</pre>\n<figure class=\"post__image post__image--left\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/24/banned-for-being-capitalist.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-xs.png 300w ,https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-sm.png 480w ,https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-md.png 768w ,https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-lg.png 1024w ,https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-xl.png 1360w ,https://treacherous.tech/media/posts/24/responsive/banned-for-being-capitalist-2xl.png 1600w\"  alt=\"Banned for capitalism\" width=\"300\" height=\"472\">\n<figcaption >Banned for capitalism</figcaption>\n</figure>\n<p>But even these rules and policies and recommended best practices won't give you the full picture about how each Mastodon is run by their own administrators.</p>\n<p>On Octodon.Social, a user's Mastodon account was suspended for \"<a href=\"https://twitter.com/LefterisJP/status/1593934653114785793\" target=\"_blank\" rel=\"noopener noreferrer\">being a capitalist</a>.\" During that account suspension, the offending money-grubbing user couldn't export their data and move to a server where these perceived capitalist leanings would be more tolerated. Strangely, the suspension notice came with an offer to unlock the account in exchange for some Monero cryptocurrency, so consider how anti-capitalist that moderator may be. This sounds more like ransom. Consider that your chosen Mastodon's moderators are not professionals. If the platform is just someone's plaything, there's no accountability. A moderator with no oversight can be a dangerous thing.</p>\n<p>Here's another case file imbued with subtle hints of irony: On Mastodon.Social, Tracy Chou, the creator of the anti-harassment app <a href=\"https://www.blockpartyapp.com/how-it-works/\" target=\"_blank\" rel=\"noopener noreferrer\">Block Party</a>, and co-founder of <a href=\"https://projectinclude.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Project Include</a> was herself <a href=\"https://twitter.com/triketora/status/1594348646396559361\" target=\"_blank\" rel=\"noopener noreferrer\">suspended from the platform</a> for the kinds of things she's helped others combat on social websites for years. The moderator suspended her for content that they felt was violating community guidelines on \"racism, sexism, homophobia, transphobia, xenophobia or casteism\" and \"incitement of violence.\"</p>\n<figure class=\"post__image post__image--right\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/24/blocktogether-creator-banned.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-xs.jpeg 300w ,https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-sm.jpeg 480w ,https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-md.jpeg 768w ,https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-lg.jpeg 1024w ,https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-xl.jpeg 1360w ,https://treacherous.tech/media/posts/24/responsive/blocktogether-creator-banned-2xl.jpeg 1600w\"  alt=\"Mastodon post for which Tracy Chou was banned, was about how she should read more rich white men's books to understand the people behind structural racism. If you have a problem with this, you're part of the problem.\" width=\"300\" height=\"649\">\n<figcaption >The allegedly offending Mastodon post by Tracy Chou</figcaption>\n</figure>\n<p>What was the post? She had commented on her reading list including non-white authors, and she said perhaps she should read books by more straight, white men so as to understand the psychology of people who have power over everyone. It was tongue-in-cheek and obviously aimed at the existing racist structure, but it had apparently struck a nerve of a tetchy moderator, and got the ban hammer. Mastodon.Social later overturned it and said the post obviously didn't pose any problem.</p>\n<p>Mastodon.Social isn't a mom-and-pop shop. It's the Mastodon that's run by the nonprofit that maintains the software itself, and likely the one with the largest user count. It's also based in Germany which has some of the most aggressive laws around content moderation. With the recent growth spurt of Mastodon users, they have had problems keeping up and have announced that they are currently trying to recruit more people for their moderation teams. However, if the flagship of the Federation is having these kinds of issues, imagine the moderation issue queue for less organised Mastodons popping up.</p>\n<pre><strong>NOTE:</strong>  To be fair, commercial platform moderators are far from perfect. Twitter had problems before, and it is now worse for having cut so many people. Facebook has several horror stories of moderation decisions gone wrong. The list goes on. There is no formalised appeals system. At least on Twitter you can fill out a form contesting the ruling and get an auto-reply message back about how they have ignored you.</pre>\n<p>I wonder whether I've picked the correct Mastodon for myself. Knowing the content moderation policies is important, but it's not enough. You should also know the country in which the platform you're using is hosted. As mentioned earlier, Item 6 on Mastodon.Social's Server Rules says, \"No content illegal in Germany.\" The country's anti-Semitism laws, ostensibly aimed at aggressively countering hate speech (and for good reason) have been repeatedly, and successfully leveraged for other purposes. They have been repeatedly<a href=\"https://www.newarab.com/opinion/german-medias-anti-palestine-purge\" target=\"_blank\" rel=\"noopener noreferrer\"> weaponised against critics of Israel's occupation of Palestinian territory</a>, and against <a href=\"https://www.aljazeera.com/news/2022/9/5/german-court-rules-palestinian-ex-dw-journalist-sacking-unlawful\" target=\"_blank\" rel=\"noopener noreferrer\">journalists covering it</a>.  A number of people on Facebook, Twitter and elsewhere have been subjected to partisan \"reporting attacks\" aimed at getting Palestinian views censored, as well as silencing others who talk about them. Having friends around Gaza and West Bank (and just being a human being), I will react toward Israel's occupation/annexation of Palestinian territory much in the way I'd react to Russia's bombardment and attempted destruction of Ukraine, or to Assad's siege on Syrian civilians. In the past that would have gone on Twitter. As a Mastodon.Social user, that's where I'd likely post it now. I kind of wonder what will happen next time I do. We'll find out.</p>\n<figure class=\"post__image post__image--left\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/24/codepink-suspended.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/codepink-suspended-xs.jpg 300w ,https://treacherous.tech/media/posts/24/responsive/codepink-suspended-sm.jpg 480w ,https://treacherous.tech/media/posts/24/responsive/codepink-suspended-md.jpg 768w ,https://treacherous.tech/media/posts/24/responsive/codepink-suspended-lg.jpg 1024w ,https://treacherous.tech/media/posts/24/responsive/codepink-suspended-xl.jpg 1360w ,https://treacherous.tech/media/posts/24/responsive/codepink-suspended-2xl.jpg 1600w\"  alt=\"CodePink kicked off a Mastodon, as described by Ben Norton.\" width=\"300\" height=\"344\">\n<figcaption >A tweet by noted twat Ben Norton.</figcaption>\n</figure>\n<p>Moderation is tough to get right. \"Federation does not fix moderation problems. Only moderation fixes moderation problems.,\" <a href=\"https://mastodon.social/@fraying@xoxo.zone/109400374407461408\" target=\"_blank\" rel=\"noopener noreferrer\">tooted Derek Powezek</a> at the start of a good thread on the subject. Consider CodePink being suspended by moderators at <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\"> <a href=\"https://mastodon.lol\" target=\"_blank\" rel=\"noopener noreferrer\">Mastodon.Lol</a>. I'm fine with it. To me, that sounds like a decision aimed at ensuring there's safe space for Ukrainians, given how CodePink and its allies mercilessly harass them across the web. Hopefully there are Mastodon administrators out there doing likewise for Palestinian users, Ulgher users, Syrian users, Iranian users, Kurdish users, and all those who are being persecuted by state actors over their identity and are then chased around social platforms by weird western \"activists\" for daring to speak out about it.</span></p>\n<p><span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">But was it really the right call? I don't pretend to be an expert on content moderation and am obviously biased in this case. The point is, without a common standard framework, open and subject to iteration to plug all the new ways that users will find to work around it, there is going to be trouble.</span></p>\n<p>The Mastodon Fediverse is missing folks. By that I mean a significant number of people who are not white, western of European descent. Without them, it's not going to work. At least for me. As people tweet about which platforms to move to (myself included), it's worth considering what's being lost amid Elon's controlled demolition of the bird site, and won't be easily replaceable. <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\">I'm particularly looking at </span><a></a>Mastodon<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\"> enthusiasts with heads in the sand. As Elon makes Twitter less of a hospitable place for users outside of his cultish fanbase, There is, as of yet (as this Wired article explores) <a href=\"https://www.wired.com/story/black-twitter-elon-musk/\" target=\"_blank\" rel=\"noopener noreferrer\">no replacement for Black Twitter</a>.</span></p>\n<p>Sure, there are many non-white Mastodon users across the Fediverse, but not in the numbers that there could or should be. A lot of BAME users have found their first steps into the Fediverse to be into hostile territory.  \"Why are so many people being banned from Mastodon instances for talking about racism and bigotry in general?\" <a href=\"https://mastodon.social/@BlackAzizAnansi@mas.to/109383447554006679\" target=\"_blank\" rel=\"noopener noreferrer\">asked user Black Aziz Anansi [In Exile] on their Mastodon profile</a>, later adding to the thread: \"Also, this is a problem because many Black activists are being run off of twitter by the change in management yet a lot of folks don't feel  comfortable posting on Mastodon. This needs to change.\"</p>\n<pre><strong>I was happy to see there is a <a href=\"https://blacktwitter.io\" target=\"_blank\" rel=\"noopener noreferrer\">blacktwitter.io</a> Mastodon while searching around during the blogging of this part of the blog. I hope it helps re-create the space that Black Twitter is/was. As of this blogging it has 1.27k users contributing 12.4k posts, a straight forward set of content standards, not unlike what you'd see on other Mastodons, and <a href=\"https://blacktwitter.io/terms\" target=\"_blank\" rel=\"noopener noreferrer\">an outstanding ToS page</a> (complete with DMCA notice) of the kind I've not seen on any other Mastodons. New users can request an invite to join.</strong></pre>\n<p>Physics prof. and Twitter/Mastodon power user Chanda Prescod-Weinstein has been <a href=\"https://twitter.com/ibjiyongi/status/1590871183503024128\" target=\"_blank\" rel=\"noopener noreferrer\">maintaining a Tweet thread</a> on the Fediverse's often hostile environment for BAME, trans and other often-targeted users: \"Women of color getting banned for talking about important issues by people who cannot be held publicly accountable. It’s all gonna be like whack a mole.\"</p>\n<p>For more on the topic, check out <a href=\"https://mastodon.social/@shengokai@zirk.us\" target=\"_blank\" rel=\"noopener noreferrer\">Johnathan Flowers</a>' Mastodon feed, or his interview on \"<a href=\"https://techpolicy.press/the-whiteness-of-mastodon/\" target=\"_blank\" rel=\"noopener noreferrer\">The Whiteness of Mastodon</a>.\" There are many other cautionary stories from BAME users of the Fediverse across Mastodon and Twitter that are just a few search queries away. The response from a community that doesn't want to exclude them can't be \"¯\\_(ツ)_/¯\".</p>\n<pre><strong>Caveat:</strong> Moderation doesn't scale well. When a platform reaches significant population, it stops working. It's a matter of physics. If enough people show up, the variety of interactions increases and an increasingly large number of them will be icky. And even vast, well-moneyed commercial enterprises running the largest social networks on the planet haven't cracked that problem, and they have an economic incentive to attempt it (to some extent). Read <a href=\"https://twitter.com/mmasnick/status/1594575441276248064\" target=\"_blank\" rel=\"noopener noreferrer\">Mike Masnick</a>'s own \"<a href=\"https://www.techdirt.com/2019/11/20/masnicks-impossibility-theorem-content-moderation-scale-is-impossible-to-do-well/\" target=\"_blank\" rel=\"noopener noreferrer\">Masnick's Impossibility Theorem: Content Moderation At Scale Is Impossible To Do Well</a>\" to learn all about it.</pre>\n<p>But that does not mean we don't make the attempt. Things can be much better. Mastodon's own nonprofit organisation should take a leading role in this. Currently, its \"best practices\" mostly seem to be limited to the technical aspects of running a social community on their software. <a href=\"https://docs.joinmastodon.org/client/guidelines/\" target=\"_blank\" rel=\"noopener noreferrer\">And it's a really solid document</a>. (I'm particularly interested in the possibility of <a href=\"https://docs.joinmastodon.org/admin/optional/tor/\" target=\"_blank\" rel=\"noopener noreferrer\">running a Mastodon as a Tor Hidden Service</a>, and kind of wonder how that would be compatible with a Fediverse construct.)</p>\n<p>There is  lot that seems to be missing, though. Mastodon gGmbH should really include its Server Covenant guidelines here, and with more depth. It should include how to think about implementing better policies, scaling them, cultivating them, and supporting moderation teams, etc. To go back to <a href=\"https://www.techdirt.com/2019/11/20/masnicks-impossibility-theorem-content-moderation-scale-is-impossible-to-do-well/\" target=\"_blank\" rel=\"noopener noreferrer\">Masnick's Impossibility Theorem</a>, What's the ideal moderator to user population ratio? 1/100? 1/200? What if Mastodons could only allow new users when additional moderators were added to maintain the ratio? Just spit balling. Online interaction is a social issue, not a technical one. There are no technical solutions to the problems of the human condition, just more band-aids.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/24/Screenshot-2022-11-26-at-19.10.21.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-xs.png 300w ,https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-sm.png 480w ,https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-md.png 768w ,https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-lg.png 1024w ,https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-xl.png 1360w ,https://treacherous.tech/media/posts/24/responsive/Screenshot-2022-11-26-at-19.10.21-2xl.png 1600w\"  alt=\"This is a FOSS tech bro Mastodon user. He writes: &quot;@ncweaver @mattblaze Some things are unavoidably hard, they require learning to do well. People who don't have the desire or the inclination to do the learning may feel excluded but that saves the experienced people an unreasonable amount of support requests from people they consider just lazy.  Look at Twitter and Facebook for examples of what happens when you lower the barrier to entry to include 'everyone'.&quot;\" width=\"1131\" height=\"544\">\n<figcaption >How to not make friends or influence anyone.</figcaption>\n</figure>\n<p> Distant cousins (though sometimes not too distant) to the bigoted users that keep BAME, women and LGBTQ+ people from feeling like the Fediverse is home are the FOSS tech bros and tech-elitists that make newbies feel horrible for the audaciousness of simply asking a question. They don't often break most moderation rules, but they really kill the mood, and cause people to rethink trusting that \"The Community\" to run itself. These guys (they're mostly guys, mostly white guys) do think the technology is the end point, and not the start. They consider themselves \"free speech absolutists\" until you don't fawn over what they see as their obvious brilliance. Each one is a kind of mini-Elon of sorts in their own way. I'll just quote computer science prof. Matt Blaze from his own Mastodon account here:</p>\n<blockquote>\n<p>\"One of the things I keep hearing here, over and over, is that 'new' people on this platform shouldn't complain about things they find confusing or that don't meet their needs. That's exactly wrong. New uses, who've not yet adapted themselves to possibly unworkable or inscrutable interfaces and limitations, are often in a unique position to have insights that old hands can no longer see. Perhaps you're tired of hearing the same complaints over and over. But think about why people make them.\" <strong>— <a href=\"https://mastodon.social/@aiefel/109405426894527197\" target=\"_blank\" rel=\"noopener noreferrer\">Matt Blaze</a></strong></p>\n</blockquote>\n<p>Anyway, I could go on here about this variety of douche, but the rest of the internet is doing that anyway. There are no moderation policies that will work on a dude who has decided their own self-defined brilliance is just an unrecognised gift to the world. Pile-ons, muting and blocking may be the best responses. Send them to the void.</p>\n<h3>Security bits</h3>\n<p>So far, I've not gone into any of the security aspects around joining a Mastodon platform.</p>\n<p><strong>Is Mastodon secure? Maybe.</strong> It depends on what you're doing with it, and who's hosting it. There is no one way to know how each Mastodon will be set up, secured, or maintained. While there are <a href=\"Note: Before we get much further, I want to warn you, dear reader, that while Tweeters\" tweet=\"\" mastodon=\"\" users=\"\" toot=\"\" so=\"\" i=\"\" occasionally=\"\" may=\"\" say=\"\" something=\"\" like=\"\" she=\"\" tooted=\"\" it=\"\" s=\"\" not=\"\" my=\"\" fault=\"\" the=\"\" verb=\"\" for=\"\" posting=\"\" there=\"\" target=\"_blank\" rel=\"noopener noreferrer\">some good practices</a> in the documentation, there's no guarantee how secure things will actually be on the Mastodon you choose. Maybe they keep the server locked down and all the software up to date, maybe they don't. Maybe there's no malware on the server, or crypto miners or data harvesters. Like any site on the web, you're trusting the owners to maintain it securely. Unlike large corporate services like Facebook or TikTok, the Mastodon you choose likely won't have big teams of people on top of this. They'll have one or two people... maybe. What happens if there's a data breach? Will the administrators know? Will they decide to tell their users? Is there a function to rapidly do that?</p>\n<p><strong>There is little transparency about security.</strong> Hosting and web security standards and transparency another area I think Mastodon gGmbH should lead. It would be great if there were transparency reports on what could be publicly scannable across the Fediverse. If you could look up any Mastodon and see what versions it's on, what score the HTTPS gets, etc. that would be something. I'd like to see a Mastodon Observatory that shows the health of any federated Mastodon instance at any given time.</p>\n<p><strong>Nothing is encrypted on a Mastodon platform.</strong> This is fine, Twitter isn't either. Your DMs are not out-of-reach of moderators and administrators. But it should be more broadly communicated on a project like Mastodon as a part of the whole FOSS ethos. Your private drafts, direct messages, notes, lists, etc. are all viewable by any Mastodon administrator with database access. Getting end-to-end encryption right, and keeping it that way, is not trivial work and I'd suggest it's out of scope for something like Mastodon. The fact should however be more clearly communicated. <a href=\"https://github.com/mastodon/mastodon/issues/21298\" target=\"_blank\" rel=\"noopener noreferrer\">Here's the current hill I may die on with this platform</a>. Mastodon administrators aren't employees (for the most part) who can be held as accountable for lurking at data, and as we've already discussed, there can be bad actors running Mastodons out there.</p>\n<p><strong>Two-factor authentication:</strong> Mastodon has this available, for both physical security keys (like Yubikeys) and authenticator apps. You can also generate recovery codes that you can keep somewhere securely and offline in case you lose your 2FA things. Use it, along with complex passphrases (long passwords).</p>\n<p><strong>Authorized apps:</strong> This is a section in your account preferences. It will show you what applications can currently access your Mastodon account. Go through it on occasion and remove anything if you don't recognise it.</p>\n<p>Electronic Frontier Foundation <a href=\"https://www.eff.org/deeplinks/2022/11/mastodon-private-and-secure-lets-take-look\" target=\"_blank\" rel=\"noopener noreferrer\">has a blog post looking at Mastodon security</a>. You may like it. Also check out <a href=\"https://themarkup.org/the-breakdown/2022/11/21/we-joined-mastodon-heres-what-we-learned-about-privacy-and-security\" target=\"_blank\" rel=\"noopener noreferrer\">this article at The Markup</a>. My advice, treat anything you put there as public and/or potential public. Do not re-use a password you use on any other platform (never re-use passwords, really), occasionally export your account data (it's easy to do) and save it in case for one reason or another the Mastodon you're on suddenly dies. Don't download strange things from strange people.</p>\n<h3>The good things</h3>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://treacherous.tech/media/posts/24/glad-game-pollyanna.gif\" alt=\"Gif from the film &quot;Pollyanna&quot; which shows her talking to an older woman and saying &quot;Thats' when you can play the 'Glad Game.'&quot;\" width=\"498\" height=\"339\"></figure>\n<p>With all that out of the way, I hope all of these things can be fixed, and it works. I want free open-source software to win. I want Mastodon, or something like it, to win. To get there, it needs to be inclusive, accessible, usable, and where people can find others they want to be around. They also need to easily be able limit their exposure to those that they don't want to hear from. There needs to be stronger transparency and reporting mechanisms for bad actors and bad Mastodons. I'm not new to the Fediverse but have been absorbed by watching it suddenly grow in the last few weeks. While I hope it works, I expect many fiery crashes along the way. It's not commercial. There is no manager to talk to. You're not going to a restaurant, but to a pot luck. You're going to have to keep track of your own casserole dish.</p>\n<p>Mastodon has a lot of decent things going for it as a model of decentralisation, and just as a platform.  The character count is better for including enough context in a post. There are good settings people should explore that let them decide how discoverable they want to be in the Fediverse, whether people can automatically follow them or not, and some tools that allow users to automatically prune their older toots, sort of like how <a href=\"https://semiphemeral.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Semiphemeral</a> works for Twitter users. You can create lists of users like you can on Twitter, but you need to be following them first. You can also write your own personal notes about other accounts on their profile pages that only you can see (and the Mastodon administrator if they bother to look). Users can choose to have a busy TweetDeck dashboard or go, like I do, for a single-column, classic feed look.</p>\n<p>One thing I particularly like in the settings is \"slow mode.\" One annoying thing about Twitter (and Mastodon) is that the avalanche of content keeps pouring. While I'm still absorbing one post, it's been shoved down to make way for what's piled on top of it. \"Slow Mode\" simply means no new content arrives on a page until you manually click a link that allows them to load.</p>\n<p>Lastly, I do like the idea that if I wanted to put in the time and effort, I could host myself on my own Mastodon, and decide what my own blocking or access policies should be. I doubt I'll get to it, and if I did I surely wouldn't open it to invites, but being able to homestead in the Fediverse is a nice freedom.</p>\n<p>There are also some things we shouldn't miss that Mastodon is lacking:  All the tracking and surveillance capitalism, for example; The algorithms that are mostly trained around how to stir the pot, make people angry, just look at the site longer; or shop.  I love a good doom scroll with my morning coffee, don't get me wrong. But I don't need machine learning to help amplify all that's wrong with the world for me.</p>\n<p>I kind of miss quote-tweets, where if you retweet a post, you can add your own comments on top of it, and question the presumption that not enabling this on Mastodon reduces negative interactions. But I appreciate the motive behind the decision. Possibly one of the best thing that Mastodon brings to the table is the good intentions, which I realise sounds fairly Pollyanna. Some people say the road to hell is paved with good intentions. I say that road can lead anywhere we want it to.</p>\n<p>I'll stay on Elon's Twitter as long as it's alive. I was there before he was, after all. If anyone should leave, he should. But I've reduced my presence there, and I now see it as an ephemeral, disposable medium. I already post on Mastodon more. I've downloaded my Twitter archive and wiped most of my content there except for the last 30 days. Anything posted there now is disposable, should the site suddenly vanish. As the song goes, \"some things you lose, some things you give away.\"</p>\n<hr>\n<h3><a id=\"masto-hacks\"></a>Tools, tricks and hacks to survive in the Fediverse</h3>\n<p>Didn't read the diatribe above? No big, here's some key take-aways about using Mastodon, living in the Fediverse without all the waffle in between.</p>\n<ul>\n<li><strong>How to choose a Mastodon:</strong> I suggest going with one that has agreed to the <a href=\"https://joinmastodon.org/covenant\" target=\"_blank\" rel=\"noopener noreferrer\">Mastodon Server Covenant</a>. You can find a searchable index of those here: <a href=\"https://joinmastodon.org/servers\" target=\"_blank\" rel=\"noopener noreferrer\">joinmastodon.org/servers</a>.\n<ul>\n<li>Do not choose a Mastodon that's run by just one or two people, or some anonymous group or something. <strong>Choose one run by an organisation, foundation</strong> or something where they have some real (financial, repetitional, etc.) stake in the game. </li>\n<li><strong>Check out what other Mastodons that one is limiting or has suspended.</strong> Decide if you are okay with that list. Are they blocking people you'd block?</li>\n<li><strong>Check out the community size on that Mastodon.</strong> Does it list the number of active users? I suggest also going to one you've already heard that a lot of your friends and mutuals on other social networks are using.</li>\n</ul>\n</li>\n<li><strong>Find people you follow on Twitter on Mastodon:</strong> When you show up some place new, it's kind of nice when you can first find some familiar faces.  <a href=\"https://debirdify.pruvisto.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Use Debirdify</a>.</li>\n<li><strong>Find more people:</strong> Once you find some Twitter mutuals (assuming you're doing that), the next thing to do may be to see who are some decent Mastodon users that they follow, and maybe add some to your list. Also check out what's happening on hashtags such as <a href=\"https://mastodon.social/tags/blackmastodon\" target=\"_blank\" rel=\"noopener noreferrer\">#BlackMastodon</a> or users from the Mastodon called <a href=\"https://blacktwitter.io/about\" target=\"_blank\" rel=\"noopener noreferrer\">BlackTwitter.io</a> and follow some accounts you like on these. One way of making things inclusive is to build up the following of people who may feel a place is kind of hostile toward them.</li>\n<li><strong>Control how things look and feel and how much content you get slapped with:</strong> I wasn't really very keen on default Mastodon when I started my Mastodon.Social account. Some settings really helped make it more comfortable.\n<ul>\n<li>The default Mastodon view looks like Tweet Deck, which I really don't like. In Mastodon \"Settings\" under \"Appearance,\"<strong> I turned off</strong> \"<strong>Enable Advanced Web Interface</strong>\" and got a very simple, single-column Twitter-like page as a result.</li>\n<li>Default Mastodon, like Twitter, will refresh your feed for you. I hate that. <strong>Fortunately, there is \"Slow Mode.\"</strong> It stops that. You can also find it in preferences, on the Appearance page, too.</li>\n<li>I hate notifications from Apps and Browsers both. <strong>I disabled all the Notifications.</strong> For some reason it still sometimes makes a sound, and I'm not sure why. Annoying.</li>\n<li>I like the idea of things like Twitter and Mastodon being more of an ephemeral experience, and don't want to keep a lot of old clutter around. <strong>Mastodon's preference section has a neat \"Automated post deletion\" page.</strong> I wish it worked. Apparently it only operates when there is extra server capacity. There never is extra server capacity.</li>\n</ul>\n</li>\n<li><strong>Manage your follows and followers.</strong> Mastodon's interface for this in the Preferences section is far better than Twitter's very basic page. It's got some nice ways to quiet quit people you may be done with.</li>\n<li><strong>Block or mute other users, mute or leave conversations.</strong> This works roughly as it does on Twitter. Do it when you feel you need to and feel good about it.</li>\n<li><strong>Block whole Mastodon domains.</strong> If you really find a lot of users from another Mastodon to be jerks, you can block the whole domain any of them are on from reaching you. If a Mastodon called \"ElonFanBoys.lol\" starts, you can just block all its users in one go.</li>\n<li><strong>Set some filters for what you want to see less of.</strong> I haven't done this yet, but Mastodon does have some good filtering tools if you want to hide certain words or phrases behind a content warning, or just block seeing them all together.</li>\n<li><strong>Avoid the \"Federated Timeline\" except as an occasional novelty.</strong> It's literally just an avalanche of nonsense from across every Mastodon in the Fediverse in chronological order. It reminds you why you only follow who you do.</li>\n<li><strong>Use Lists.</strong> In the right-hand sidebar you can create lists of users based around any category you want. Creating your own lists of what you want to see is you being your own algorithm. You can only add people you follow, which is a limitation, but it has some other custom options that I think make it better than Twitter's lists.</li>\n<li><strong>Use notes.</strong> On Mastodon, every profile has a section where you can write yourself a little post-it not about what you think of them. The other person doesn't see it. Can be good to remind yourself why you followed them (or didn't).</li>\n<li><strong>Keep your own local backups.</strong> Mastodon lets you export your own data at any time, and it's easy to do. Keep local copies, don't trust other people's clouds.</li>\n<li><strong>Keep Control of your account.</strong> Unlike more commercial, well-moneyed platforms, there is no real account recovery or safety team behind your Mastodon. It could be harder to report a stolen or hacked account. An ounce of prevention will make your life much easier.\n<ul>\n<li><strong>Use a strong password.</strong> 14 characters or more. Different from all of your other passwords. Randomised or some sort of long phrase or sentence, with punctuation. That's not unique to Mastodon, do that everywhere.</li>\n<li><strong>Use two-factor authentication.</strong> Mastodon offers it, use it. </li>\n</ul>\n</li>\n<li><strong>Don't have confidential conversations or expect real privacy on a Mastodon.</strong> I'd say the same thing about Twitter or most other platforms not built around end-to-end encryption (E2EE). I'd say that around ones built around kind of shit encryption too, say Telegram. WhatsApp, Wire, Signal, Matrix, Briar all have well-implemented E2EE. Move confidential chat there. I don't even think I'd recommend a roadmap for it on a thing like Mastodon. I do think it should be more transparent about how transparent things are. Wherever you see a 🔒in the user interface (outside of your browser's address bar where it means the site has SSL) just know that has nothing to do with security.</li>\n<li><strong>Should you host a Mastodon yourself?</strong> Let's see...\n<ul>\n<li><strong>Short answer:</strong> No. </li>\n<li><strong>Longer answer:</strong> Let's look at some different use cases:\n<ul>\n<li><strong>A Mastodon of one's own:</strong> If you are technically able to, curious to understand how Mastodon works, or if you want to fine-tune your own experience, host a one-person Mastodon just for you. <em><span style=\"color: #ba372a;\"><strong>Important(!):</strong></span> <span style=\"text-decoration: underline;\">Don't let anyone else join it!</span></em> Just make that your own personal address for engaging with the rest of the Fediverse, it works just fine. There are a quite a few people doing this. You can do all sorts of custom things to your own platform. Give yourself a blue tick if you like, or three of them. Choose which other Mastodons to block, control the whole look and feel of your profile page when others from elsewhere in the Fediverse drop by. Go nuts, make it look like your old Myspace page with JavaScript glitter, animated gif backgrounds. and some pop song that plays as soon as the page loads. The best mad scientists always experiment on themselves. Tom would be proud.</li>\n<li><strong>Your own Mastodon for the many:</strong> Stop now. This way madness lies. If want to DIY a whole Mastodon community platform by your lonesome with potentially dozens or hundreds or thousands of other users, my question would be: Why? To do it correctly, you're in for a lot of extra, unpaid, thankless effort, and it still may not be enough. No one says nice things when websites work, but they can get very outraged when they don't. Moderators are the referees everyone loves to hate and second guess. You will make no friends and lose some. And then consider the legal liabilities you're going to be held responsible for when something goes bad. Just Don't. Find a hobby or join a gym. Or, if you really want to be on that side of things, just volunteer to be a moderator on some other Mastodon that already exists and needs help until you've gotten it out of your system.</li>\n<li><strong>Entities bigger than a single human:</strong> If you're a company, NGO, nonprofit organisation, university, or some sort of institution or large collective of beings, doing this may make some sense depending on what kinds of services and tools are of use to the staff, community, members, students, or etc. you serve. Just make sure you're putting resources into monitoring, moderating and keeping your Mastodon safe and secure for all its users.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>And that's it, that's the end of my gargantuan post on Mastodon. I have no idea if the Fediverse is a stopover or a destination in the great social web migration. Tumblr, Flickr, and other online services have hinted that they are considering adopting the technology Mastodon uses to share content across the web, called <a target=\"_blank\" rel=\"noopener noreferrer\">ActivityPub</a>. I think that will likely outlive Mastodon itself. That would be good news for Mastodon users; it means they can migrate to other things without losing their entire data backstory if they want. Or maybe not. Every creation on the web is eventually a set of cautionary lessons for what comes along to replace it. Sorry.</p>\n<blockquote>\n<p>\"Ever tried. Ever failed. No matter. Try Again. Fail again. Fail better.\" <strong>— Samuel Beckett</strong></p>\n</blockquote>",
            "image": "https://treacherous.tech/media/posts/24/mastodon-skeleton.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "twitter",
                   "social networks",
                   "mastodon"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/dead-bird.html",
            "url": "https://treacherous.tech/dead-bird.html",
            "title": "Some notes about life on a Mastodon",
            "summary": "With Elon destroying Twitter, a lot of people are looking to move their online social life elsewhere and it seems Mastodon's decentralised 'fediverse' is where many of them are parachuting. Most are still keeping their Twitter accounts alive until&hellip;",
            "content_html": "<p>With Elon destroying Twitter, a lot of people are looking to move their online social life elsewhere and it seems Mastodon's decentralised 'fediverse' is where many of them are parachuting. Most are still keeping their Twitter accounts alive until the bitter end, but as the horde moves, there are some people who are finding the experience of life on a largely volunteer run network based on free open source software maintained by a German nonprofit kind of different. I've got a longer blog post coming, but thought I'd dash in some (rough) notes that are hanging around my screen for now. (Also so I can close some tabs).</p>\n<ul>\n<li><a href=\"https://themarkup.org/the-breakdown/2022/11/21/we-joined-mastodon-heres-what-we-learned-about-privacy-and-security\" target=\"_blank\" rel=\"noopener noreferrer\">The Markup</a> has a very good break down of what life is like on a Mastodon server, read it. It covers many issues you'll want to consider before joining.</li>\n<li><a href=\"https://www.eff.org/deeplinks/2022/11/mastodon-private-and-secure-lets-take-look\" target=\"_blank\" rel=\"noopener noreferrer\">The Electronic Frontier Foundation has given a very close look</a> at the security issues around Mastodon as a platform and as a decentralised \"fediverse.\" Read that, too.</li>\n<li>If you're considering hosting a Mastodon community yourself, my only suggestion is to think about it really carefully. And then think again. Go for a walk, have a lay down. Then, aside from the technical piece of running a social network effectively and securely, read this <a href=\"https://denise.dreamwidth.org/91757.html\" target=\"_blank\" rel=\"noopener noreferrer\">guide to potential liability pitfalls for people running a Mastodon instance</a>.</li>\n<li>Here's a good <a href=\"https://twitter.com/mmasnick/status/1594575441276248064\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter thread</a> on the difficulties of moderation. Imo, people are jumping over to Mastodon with the expectation of being treated like customers. There is no commercial component to it. You are not a customer. People are not doing this for work.</li>\n</ul>\n<p>There is not one Mastodon, but many. It's a federation and anyone can host one but not all are created equal. The whole \"just choose any server\" UX needs work. There are nutter Mastodons out there. Dodgy ones, too. There are also a number of fairly friendly ones. Twitter is/was a centralised commercial service currently under control of an erratic, billionaire man baby. Mastodon platforms are run by all sorts. I don't think any of them are billionaires. They may have other issues.</p>\n<p>Trolls, bots, harassment and abuse are in the fediverse as well. Mastodon doesn't solve the moderation problem, it shifts it and creates strange new quandaries. Instead of the central dictator, you have fiefdoms, some with their petty tyrants, others with inconsistent or corrupt policing, and many seemingly with no sheriff in town at all. Still others have structures with reasonable user expectations and volunteers who do look like they are trying to get it right.</p>\n<p>That's not to make light of serious matters. Abuse, threats, attacks, creepy guys sending unsolicited dick pics, attempts at blackmail, and other horrors I won't even list here are serious, and need to be treated seriously. And I'd argue a lot of commerical platforms also don't take them as seriously as they should, but arguably a small scrappy band of volunteer mods on an open source platform are far less resourced to do it. I encourage reporting these people, outing them and using public humiliation, and any relatively safe avenues of vigilanteism that ruins them, but the reality is that they prey on fear and embarrassment. It's a community problem that needs community support. That's not a conclusive answer to the problem, but I don't think I have one. I don't think any one person has one.</p>\n<p>Mastodon isn't private. There is no end-to-end encryption, but there really isn't on a lot of other services you use, too. I would be careful of what I posted there. You can DM someone but this stands for Direct Message, not Private Message. Any one with administrator access can view all your content. I don't like that the DM button includes an icon of a padlock, as people often associate that with encrypted messaging. There isn't any. If you want to keep the content of your conversation private, you need to use something with end-to-end encryption. Signal. Wire. Matrix. Element. Briar. Even WhatsApp. Take that conversation somewhere else. I would say the same thing about Twitter DMs. A lot of people don't realise what service administers have access to. </p>\n<p>I'm not new to the fediverse, but have been absorbed by watching it suddenly grow. Hope it works, expect many fiery crashes along the way. It's not commercial. There is no manager to talk to. You're not going to a restaurant, but to a pot luck. Keep track of your casserole dish.</p>\n<p>A lot of people come over to a Mastodon platform, and what they see first is what's missing. There's no algorithm studying you to figure out what you might want to see. Some things they were used to Twitter doing for them don't exist. Remember, Twitter is/was a multi-billion dollar business that (Even with all the layoffs and quitting) still has thousands of employees.  Mastodon is run by people doing so largely in their spare time for free, because they believe in it, on servers they pay for out of their own pockets.</p>\n<p>I want Mastodon, or something like it, to win. I want free open source software to win. I want decentralised, community run systems to win. But to win, it has to be accessible, usable, secure, and inviting to everyone. There are a number of problems with it, which I hope to get to in another post. But it does at least seek to offer an alternative model. For those who don't like Big Tech, surveillance capitalist business models, and all of that stuff, go live in the other world for a while. Set fire to your ideas of finding some kind of internet utopia in the process. The world is trade-offs, and nothing is permanent. Maybe you like it and maybe you don't. The worst that probably happens is you delete another account.</p>",
            "image": "https://treacherous.tech/media/posts/23/smithsonian-mastodon_wide-e3c513d73649e702c15179dddc3a07a5473a0d1c-s1600-c85.webp",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "twitter",
                   "social networks",
                   "mastodon"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/help-keep-the-internet-open-for-iranian-users-and-for-anyone-where-its-censored.html",
            "url": "https://treacherous.tech/help-keep-the-internet-open-for-iranian-users-and-for-anyone-where-its-censored.html",
            "title": "Help keep the internet open for users in Iran (and for anyone where it&#x27;s censored)",
            "summary": "There are brave people in the streets around Iran following the death of Mahsa (Jina) Amini, an Iranian Kurdish woman, while being held by the \"morality police\" over a supposed offence of not wearing a hijab in the correct&hellip;",
            "content_html": "<p class=\"dropcap\">There are brave people in the streets around Iran following the death of <a href=\"https://en.wikipedia.org/wiki/Death_of_Mahsa_Amini\" target=\"_blank\" rel=\"noopener noreferrer\">Mahsa (Jina) Amini</a>, an Iranian Kurdish woman, while being held by the \"morality police\" over a supposed offence of not wearing a hijab in the correct way. Typical to the regime's violent response to the protests, it is also ramping up its already aggressive online censorship. I'm dropping a couple of things here that someone with a computer or internet server can do to help people in the country maintain access to secure digital communication tools and both access or publish information online.</p>\n<h3>Help maintain access to the Tor Network</h3>\n<p class=\"msg msg--info msg--highlight \"><strong>Difficulty level:</strong> Easy.</p>\n<p>If you use either the Chrome or Firefox Browser, you can quickly set up and run <a href=\"Snowflake helps make the Tor Network faster and more useable\" target=\"_blank\" rel=\"noopener noreferrer\">Snowflake</a>. This helps create Tor relays for users of The Tor Browser, creating faster more useable access. The Tor Network helps defeat censorship by bouncing traffic through servers in a way that evades blocking and also helps improve a user's ability to protect their privacy and stay anonymous, and more secure online. There are a number of ways to set up Tor relays, but Snowflake is pretty easy.<a href=\"https://snowflake.torproject.org/\" target=\"_blank\" rel=\"noopener noreferrer\"></a></p>\n<ul>\n<li>You can get it for <a href=\"https://addons.mozilla.org/en-US/firefox/addon/torproject-snowflake/\" target=\"_blank\" rel=\"noopener noreferrer\">Firexfox here</a>.</li>\n<li>You can get it for <a href=\"https://chrome.google.com/webstore/detail/snowflake/mafpmfcccpbjnhfhjnllmmalhifmlcie\" target=\"_blank\" rel=\"noopener noreferrer\">Chrome here</a>.</li>\n<li>Or, you can just leave this page open in a tab on your web browser, turn on the widget at the bottom of this post, and just let it run.</li>\n</ul>\n<p>Snowflake is super easy, and low-bandwidth. You're computer is supporting relay nodes, not exit traffic, and there is no connection to you or the users on the Tor Network or what they do. You do get a nifty statistic to see how many users you're browser plugin has helped in the last 24 hours. So far today (as of this writing), mine has helped 18 people reach some destination over Tor.</p>\n<p><em>If you feel like geeking out, have some system administration skills, and want to do something more involved, you can run a server with it's <a href=\"https://community.torproject.org/relay/setup/snowflake/standalone/\" target=\"_blank\" rel=\"noopener noreferrer\">own stand-alone Snowflake instance</a>, or <a href=\"https://blog.torproject.org/new-guide-running-tor-relay/\" target=\"_blank\" rel=\"noopener noreferrer\">run a Tor relay server</a>.</em></p>\n<h3>Run a Signal proxy</h3>\n<p class=\"msg msg--info\"><strong>Difficulty level:</strong> Medium.</p>\n<p>The Iranian government is blocking connections to Signal servers. Signal is a secure, end-to-end communications app used by journalists, activists, political figures, and maybe your mom. It has a number of privacy supporting features aside from the encryption, such as disappearing messages. You should use it. You should help people where it's blocked use it, too. Signal has create an open source proxy server set up, that helps create bridges that bypass the blockade. </p>\n<p>for this one, you should be comfortable in the command line, and be able to run an always-on internet server, though it can be a pretty small one. <a href=\"https://signal.org/blog/run-a-proxy/\" target=\"_blank\" rel=\"noopener noreferrer\">Here's more on how to run one</a>.</p>\n<hr>\n<h3>Run Snowflake in your browser</h3>\n<p>Turn this on, and leave this tab open in your browser, and it will help users on the Tor Browser get more relay bridges to access the web and bypass censorship.</p>\n<p><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"320\" height=\"240\" src=\"https://snowflake.torproject.org/embed.html\" frameborder=\"0\" scrolling=\"no\"></iframe></div></p>",
            "image": "https://treacherous.tech/media/posts/22/snowing-background-1547722510q67.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "how to",
                   "encryption",
                   "activist"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/onionshare-back.html",
            "url": "https://treacherous.tech/onionshare-back.html",
            "title": "Onionshare secure contact form is back online",
            "summary": "The Onionshare site went offline again for a little while while I was offline and on holiday for a few weeks. Gremlins, you know. But it's back on now: That's just one of the hazards of self hosting on&hellip;",
            "content_html": "<p>The Onionshare site went offline again for a little while while I was offline and on holiday for a few weeks. Gremlins, you know. But it's back on now: That's just one of the hazards of self hosting on my own little DIY clouds. <a href=\"https://onionshare.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Onionshare</a> is a secure contact form developed by digital security technologist Micah Lee. I blogged a while back about <a href=\"https://treacherous.tech/hosting-a-secure-contact-form.html\">how to set up a persistent version with a Raspberry Pi</a>.</p>\n<p>My point for having it is to essentially offer a reasonably secure online form for users to contact me or send stuff. I've gone this route as most other self-hosted forms are a mess and commercial third-party tools aren't that privacy respecting. For this one to work you need to use the <a href=\"https://www.torproject.org/download/\" target=\"_blank\" rel=\"noopener noreferrer\">Tor Browser</a>.</p>\n<p><strong>Throw things at:</strong></p>\n<p class=\"msg--warning\"><code><a href=\"http://entyms3fdn4fyl6lizog6hoztvaqkvv2njmcovslkm55xhahs7nnmiqd.onion/\">http://entyms3fdn4fyl6lizog6hoztvaqkvv2njmcovslkm55xhahs7nnmiqd.onion/</a></code></p>\n<p>If you're an independent journalist it's also a tool you can use for your sources without too much hassle, but some operational security is advisable as you're essentially asking strangers to send you files that may do anything. This is why I tend to prefer it to be on it's own little device, accessed by a throw-away machine in the middle for file inspection.</p>",
            "image": "https://treacherous.tech/media/posts/20/women-telephone-operators-at-work-12-jpg.jpeg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/i-cant-keep-up.html",
            "url": "https://treacherous.tech/i-cant-keep-up.html",
            "title": "I can&#x27;t keep up",
            "summary": "I'm the worst blogger. Too much happens between the time I think I may want to write about something and when I actually get around to doing it, and my attention span is also a wreck. Micro-post formats like&hellip;",
            "content_html": "<p>I'm the worst blogger. Too much happens between the time I think I may want to write about something and when I actually get around to doing it, and my attention span is also a wreck. Micro-post formats like <a href=\"https://twitter.com/andrewfordlyons\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter</a> and <a href=\"https://mastodon.social/web/@aiefel\" target=\"_blank\" rel=\"noopener noreferrer\">Mastodon</a> are more my thing. I have more enthusiasm to relaunch the site on a new platform than I do to actually write anything on it. It's more of just a presence. An address. A place to let the world know I'm still tenuously interested in contact. Now, here are some things...</p>\n<h3>Book</h3>\n<p>in book news, I've just finished '<a href=\"https://www.penguin.co.uk/books/309409/the-new-breed-by-darling-kate/9780241352991\" target=\"_blank\" rel=\"noopener noreferrer\">The New Breed</a>', by Kate Darling. In it, Kate looks at how we talk about robots and to a lesser extent but very related, machine learning and artificial intelligence, as robotic machines become... smarter. The idea is that humans think about it wrong. We anthropomorphise the machines and look at them as some kind of emerging other human, either as a companion, competitor, villain or tragic hero. In fact they're tools that move around. And humans have a history of these, namely, animals and our relationship with them. If we wanted to make better analogies, we should look at the history of humans partnering with animals with both positive and less desirable outcomes.</p>\n<p>Thoroughly enjoyed this book and recommend it. Most of my nonfiction tech reading looks like the source material for an episode of Black Mirror. Even this site's domain is inspired by the more darker side of technology's potential. I'm more often a Debbie Downer: How will it go wrong? How will it be weaponised? What stupid applications will capitalist industry make of something that could be revolutionary in better hands? You may even get to thinking that for someone who self-applies the job title \"technologist\" this guy doesn't really like it that much. And that would be wrong. In fact, I like a lot of the things that society is most afraid of. I love the big data, the algorithms, the AI, and machine learning models. I'm even okay reading a blockchain white paper, even if it's to once again see how it's a rubbish solution for a problem that may not even exist. And I enjoy a good robot. I even like those <a href=\"https://www.bostondynamics.com/products/spot\" target=\"_blank\" rel=\"noopener noreferrer\">BostonDynamics robot dogs</a> that freak people out. I draw the line at <a href=\"https://www.theverge.com/2022/7/28/23282023/dead-spiders-robot-grippers-necrobotics-research-rice-university\">necrobotic spiders</a>, though.</p>\n<p>The issue with autonomous machines are the same as with any technology. It's the humans. Scare stories about robotic doom land about weekly. Recently there was the news about <a href=\"https://www.theguardian.com/sport/2022/jul/24/chess-robot-grabs-and-breaks-finger-of-seven-year-old-opponent-moscow\" target=\"_blank\" rel=\"noopener noreferrer\">the chess-playing robot that broke the finger of its seven-year-old human opponent</a>. \"Moscow incident occurred because child ‘violated’ safety rules by taking turn too quickly, says official\" the article's subheading read. This is of course, ridiculous, but it's not far unlike the story that appears in 'The New Breed' about the <a href=\"https://www.theguardian.com/world/2015/jul/02/robot-kills-worker-at-volkswagen-plant-in-germany\" target=\"_blank\" rel=\"noopener noreferrer\">worker killed by a robot arm</a> when he went into the space the robot arm operated, and isn't unlike the stories of Amazon's robot  workers (who are meant to mix with human work environments) that <a href=\"https://www.bbc.co.uk/news/technology-54355803\" target=\"_blank\" rel=\"noopener noreferrer\">occasionally injure one of the humans working alongside them</a>. What's interesting in these stories is that at some point, someone will say the worker, or child chess player, broke a rule (and so suffered the consequences). In the zeal to deflect liability, you end up with corporate hacks who sounds robotic themselves. In fact, it's a failure of design and appropriate use case. The point is, we've been around autonomous non-human workers, companions, for our entire history: animals, and arguably already more sentient and intelligent than even the most sophisticated AI running today. </p>\n<p>It's important to think about now. We should define the tools around us before they're defined for us. It's not difficult to imagine how wrong that can go without thinking of The Terminator or the Matrix or boo-scary scenarios that imagine robot brains operating roughly like human brains do: meaning they want to fuck everything up asap. We currently have policymakers that don't even understand the basics of internet security <a href=\"https://www.theregister.com/2022/07/22/british_encryption_scanning/\" target=\"_blank\" rel=\"noopener noreferrer\">and yet make annual attempts to break it</a>. The world is moving fast, and things are breaking. I can't keep up.</p>\n<h3>Web Browser plugin</h3>\n<p>We all hate those GDPR-mandated \"consent\" pop-ups that plague the web, even if many of us can appreciate the idea that we should get to opt-in/out of pervasive tracking. A number of web platforms have gone the passive-aggressive route that complies with the letter of the law, while making the decisions and controls as opaque or complicated as possible, unless you just want to quickly select \"yes\" and ignore what you've agreed to. Most people do that. Anyone surfing the web has not time for that madness, and if you're doing actual work, these consent forms are adding on hours. The open source project, <a href=\"https://github.com/cavi-au/Consent-O-Matic\" target=\"_blank\" rel=\"noopener noreferrer\">Consent-O-Matic</a> aims to address that.</p>\n<p>Works on Chrome, Firefox and Safari browsers. You can install it, set your preferences in the plugin settings, and then it fills out those forms in seconds when you visit the websites. It doesn't work on every one, but most larger sites use common 3rd party GDPR-consent form providers or a framework the plugin is designed to recognise. And you get the joy of watching it quickly fill out everything in a small window and disappear while you get on with reading your article. This is a reasonable hack until websites just start designing their cookies to not be intrusive and just respect privacy by default (and then not need GDPR opt-in forms).</p>\n<h3>Shows</h3>\n<p>Caught Channel 4's '<a href=\"https://www.channel4.com/programmes/the-undeclared-war\" target=\"_blank\" rel=\"noopener noreferrer\">The Undeclared War</a>' and found it to be a mixed bag, attempting to do too much in not enough episodes. Essentially set in GCHQ it follows a series of cyber attacks between Russia and UK with a sort of \"grounded-in-reality\" approach. I don't think a work placement person would see this much action, really. Also, in trying to ground itself in reality it dates itself too quickly, taking place after the show's fictitious prime minister ousts Boris Johnson in a leadership contest. All the attacks are plausible, but not nearly at this rate. And adding some family drama and a go-nowhere unresolved romance just muddled it further. There is still a good cyber war film or show to be made, and this one isn't quite it.</p>",
            "image": "https://treacherous.tech/media/posts/21/fbi-bot.jpeg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "web",
                   "life ",
                   "books"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/some-more-notes-on-the-spotify-kerfuffle.html",
            "url": "https://treacherous.tech/some-more-notes-on-the-spotify-kerfuffle.html",
            "title": "Some more notes on the Spotify kerfuffle",
            "summary": "This post is a rambling continuation of another one here. Do you need to read that one first? I have no idea. The Spotify story just keeps on giving. What's neat about it is how many cultural zeitgeists and&hellip;",
            "content_html": "<p>This post is a rambling continuation of <a href=\"https://treacherous.tech/spotify-kerfuffle.html\">another one here</a>. Do you need to read that one first? I have no idea.</p>\n<p>The Spotify story just keeps on giving. What's neat about it is how many cultural zeitgeists and trends are mashed in a single event. We've got capitalism vs. social responsibility, science literacy vs ignorance, the cult of celebrity, the belief in consumer choice as a source of political and social activism, platform terms of service being substituted as the law of the land on regulating free speech, data rights, privacy, creator control and fair compensation, copyright, and etc. etc. etc. It's all here. The world will burn to an algorithmically generated playlist.</p>\n<p>Since Spotify decided to go with Joe Rogan's podcast over Neil Young's music in Young's ultimatum over the talk show's repeated amplifying of pandemic and vaccine misinformation, <a href=\"https://mediatraffic.org/2022/01/29/spotify-loses-4-billion-in-market-value-after-neil-young-controversy/\" target=\"_blank\" rel=\"noopener noreferrer\">the platform's market value has lost $4 billion</a>. With its <a href=\"https://americansongwriter.com/spotify-stock-down-25-as-artists-leave-platform-rumors-of-foo-fighters-departing-swirl/\" target=\"_blank\" rel=\"noopener noreferrer\">stock dropping 25%</a>, Joni Mitchell and other performers announcing or rumoured to be considering pulling off of Spotify, it's an amazing little surge of creators showing what control can look like.</p>\n<p>My premium account expired yesterday, and so it goes. Spotify has a good user interface. The algorithm is also fairly decent at pitching tunes I'll likely enjoy. For the WFH years of this pandemic, it really was in the background a lot of the time, as I assume it had been for a lot of people. I don't think it's a coincidence that Spotify's value surged as more people were cut off from the outside world, sort of like how the plague times helped Amazon. And again, no one paid attention to the fact that Joe Rogan had a platform there until Spotify decided it was worth paying him $100 million to quit Apple Music and any other platform. So, all around, the teachable lesson here is that platforms should let creators upload where they want, and instead compete for them via better compensation models instead of high-stake gambling of exclusivity.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/19/Napster_running_on_an_original_iBook_2001-03-11.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-xs.png 300w ,https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-sm.png 480w ,https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-md.png 768w ,https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-lg.png 1024w ,https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-xl.png 1360w ,https://treacherous.tech/media/posts/19/responsive/Napster_running_on_an_original_iBook_2001-03-11-2xl.png 1600w\"  alt=\"The official Napster client runs on an original iBook running Mac OS 9. The Search and Transfer Manager windows are visible. Several MP3 downloads are underway over a dialup Internet connection. (Wikimedia)\" width=\"800\" height=\"600\">\n<figcaption >\n<p class=\"mw-mmv-title-para mw-mmv-ttf-container mw-mmv-title-smaller\"><span class=\"mw-mmv-title\">The official Napster client runs on an original iBook running Mac OS 9. The Search and Transfer Manager windows are visible. Several MP3 downloads are underway over a dialup Internet connection. (Source: Wikimedia)</span></p>\n<div class=\"mw-mmv-image-metadata-column mw-mmv-image-metadata-desc-column\"> </div>\n</figcaption>\n</figure>\n<p>What I also really appreciate from the whole embroglio imbroglio is that people are once again talking about copyright and other forms of file streaming. Napster, Limewire, and a load of other pre-web services allowed for decentralised and ubiquitous file sharing. <a href=\"https://en.wikipedia.org/wiki/Metallica_v._Napster,_Inc.\" target=\"_blank\" rel=\"noopener noreferrer\">Metalica</a> may not have liked it <a href=\"https://techcrunch.com/2007/12/08/50-cent-file-sharing-doesn%e2%80%99t-hurt-artists/?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAIc1b995LotsgzT0RScovBEP0mzTxAHXMCQSKKu83k_wTmrEevrqxTkAh8YfsDD3hg5nEEg_RNyvOn5f4QIo8_uoHB1RZJfP_y6ZxToKgo-aaSckQ-VkkROHbVnlBF-RQ2y2CpO3DSsyvV1GO5PChEv6yHajGhNBSU1NcyKch5JI\" target=\"_blank\" rel=\"noopener noreferrer\">but it was good for others</a> in getting attention and interest in their live gigs. Performers didn't really win in the copyright wars. Listeners certainly didn't. We had all these great running between apps, decentralised, networks of fans, running FTP hosts or being torrent seeders (still around to some extent).</p>\n<p>What this isn't really about is free speech, though it works in Spotify's interests to frame it that way. It of course has the legal right to host Rogan and any other podcaster it likes. It doesn't have the right to demand market value, subscribers or people looking at their ads. Free speech protection is not about the right to profits.</p>\n<p>Related, but at a lower volume, <a href=\"https://www.theguardian.com/technology/2022/jan/27/anti-vaxxers-making-at-least-25m-a-year-from-publishing-on-substack\" target=\"_blank\" rel=\"noopener noreferrer\">e-newsletter service Substack came under fire last week</a> over the hight volume of anti-vaccine pundits are using its service to reach and grow their audiences. Apparently, these content creators have earned a combine $2.5 milion a year from their Substack subscribers. Now, who know's how may of these wingnuts there are and how much of that amount each is getting. I imagine there are a few bigger voices taking the most of it and then some fringe of the fringe group getting the rest. But Substack gets a percentage of that whole amount, so it's definitely profiting off of covid-29 disinformation.</p>\n<p><a href=\"https://on.substack.com/p/society-has-a-trust-problem-more?r=1im5e&amp;utm_campaign=post&amp;utm_medium=web\" target=\"_blank\" rel=\"noopener noreferrer\">Substack's says</a> it doesn't do content moderation and respects free speech. It's a different situation to Spotify in one very key way: Substack is not buying these people exclusively for its platform. It's not giving a writer several million dollars to just publish on Substack. These writers have kind of an equal footing as any other content creator on Substack. I actually don't think Substack should \"censor\" content creators either, and <a href=\"https://techcrunch.com/2020/07/15/substack-launches-defender-a-program-offering-legal-support-to-independent-writers/\" target=\"_blank\" rel=\"noopener noreferrer\">Substack does seem to put some money</a> behind it's free speech mantra.</p>\n<p>Still, in its own blog post defending its policy, there are a <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">lot of concepts muddled together, essentially to protect a a business model. Substack is a vanity press. That's fine. The internet runs on them. It's not countering society's \"trust problem\" with the media. The trust problem is not a free speech problem, it's a media literacy problem. In many ways, Substack works against solving the trust problem, it provides a platform for people to bypass the public scrutiny that builds credibility. At the end of the day, it's an e-newsletter tool. It's hip MailChimp. You know that line \"politics is show business for ugly people,\" right? Exchange \"politics\" with Substack and \"show business\" with Onlyfans. That's Substack. <a href=\"https://www.isdglobal.org/digital_dispatches/anti-vaxxers-qanon-influencers-and-white-nationalists-flocking-to-substack/\" target=\"_blank\" rel=\"noopener noreferrer\">This is why</a> it gets the anti-vaxxes, the QAnons, and the White Nationalists. Not sure how that builds trust. </span></p>\n<p>At the center of all of this is the commodity of providing a platform or infrastructure that allows others to express themselves. This then becomes a set of business decisions, mundane, boring and based on bottom lines. Substack, Spotify, Facebook, or whatever other commercial platforms you want to include here are not advocacy organisations. They exist to monetise human behaviours. There are things people want to do on the web, and they exist to facilitate that to turn a profit, through subscriptions, ads, monetising user data or whatever else can be thought of. So long as the free speech protection debate is muddled with profit motives of content platforms, it will be defined as whatever happens to be in the best interest of business, which can always change. Platform terms of service are a horrible substitute for good laws and protection of rights.</p>\n<div class=\"css-1dbjc4n\">\n<div id=\"id__znxag5kkn\" class=\"css-1dbjc4n\" aria-labelledby=\"id__78yjugh30ik id__9e7153902bm\">\n<div class=\"css-1dbjc4n r-1s2bzr4\">\n<div id=\"id__9e7153902bm\" class=\"css-1dbjc4n r-1ets6dv r-1867qdf r-1phboty r-rs99b7 r-1ny4l3l r-1udh08x r-o7ynqc r-6416eg\" aria-labelledby=\"id__ocpzqgcu5bg id__les79acjiqo\" data-testid=\"card.wrapper\">\n<div id=\"id__ocpzqgcu5bg\" class=\"css-1dbjc4n r-140t1nj r-pm2fo r-zmljjp r-rull8r r-qklmqi r-1adg3ll\" aria-hidden=\"true\" data-testid=\"card.layoutLarge.media\">\n<div class=\"css-1dbjc4n r-1adg3ll r-1udh08x\"> </div>\n</div>\n</div>\n</div>\n</div>\n</div>",
            "image": "https://treacherous.tech/media/posts/19/spotify-logo-zoom-s.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/spotify-kerfuffle.html",
            "url": "https://treacherous.tech/spotify-kerfuffle.html",
            "title": "Some notes on the Spotify kerfuffle",
            "summary": "Here it is Friday after work, and I am without an obligatory Spotify playlist filling the background while settling into the dubious plan of attempting to write something on the blog. Why? because I canceled my Spotify family plan&hellip;",
            "content_html": "<p>Here it is Friday after work, and I am without an obligatory Spotify playlist filling the background while settling into the dubious plan of attempting to write something on the blog.  Why? because I canceled my Spotify family plan and logged out of the account, and when time allows I'll export my mess of playlists elsewhere and delete it. Why? Because Neil Young (whose music I do enjoy but admittedly rarely listen to) has pulled his work from the platform. Why? Because Spotify paid $100 million to exclusively host a sketchy podcast series hosted by this guy Joe Rogan, who regularly puts out dodgy information about our current pandemic. I also don't really listen to Joe Rogan, and the scant bits and pieces I've heard of his show reaffirm that lifestyle choice. It's a dumpster fire of nonsense. So considering that the current drama is between two people I don't spend much time on, why would I close an account based on it? Let me explain, gentle reader, while listening to Reykjavík's own <a href=\"http://radio.garden/listen/apparatidj/3Kv37fX2\" title=\"Can someone explain why this site has no https?\" target=\"_blank\" rel=\"noopener noreferrer\">Apparatið radio</a> on <a href=\"http://radio.garden\" title=\"I enjoy this site, but if you switch to another browser tab it quits.\" target=\"_blank\" rel=\"noopener noreferrer\">radio.garden</a>.</p>\n<p>As is this blog's policy, we're not going to go through the whole background of this story. It's all over the media, so go find it. <a href=\"https://www.theverge.com/2022/1/25/22900437/neil-young-spotify-joe-rogan-vaccine-misinformation\" title=\"Go on, get the facts before my self indulgent ruminations. I'll wait. I got all night. \" target=\"_blank\" rel=\"noopener noreferrer\">Find it here</a>. So you might think this story is about dangers of misinformation (disinformation if you think there's strategic intent to deceive), and there's surely elements of that here. Thousands of people are continuing to dro Spotify as I write this and maybe even as you read it (depending on when you're doing that)  for choosing misinformation grifter Joe Rogan over a principled rock icon Neil Young. They are proudly tweeting, facebooking or redditing that they'd jumped over to Apple Music, TIDAL, Bandcamp, and and so on because Spotify is platforming a dangerous anti-vaccine conspiracy nutter.</p>\n<p>If that's the case, they're all in for a shock. Rogan left Apple Music not because he got booted out. Spotify just spent heaps of moola for exclusive rights to his show, that's all. Apple was fine with him being there and there's plenty of other legacy Rogan stuff still on its platform. And if you're worried about nutters having a right wing nutters and fascists having a voice, Apple hosts <a href=\"https://podcasts.apple.com/us/podcast/bannons-war-room/id1485351658\" title=\"Steve Bannon is far worse than Joe Rogan. Rogan is just a narcissist. Bannon has a vision.\" target=\"_blank\" rel=\"noopener noreferrer\">Steve Bannon</a>'s show. I don't know if you can find antisemitic, anti-science podcast TruNews on Apple Music, <a href=\"https://apps.apple.com/us/app/trunews/id880594743\" title=\"Far more insane than Joe Rogan can hope to be.\" target=\"_blank\" rel=\"noopener noreferrer\">but you can find it on its iPhone app store</a>. The point: <span style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\">A bit of searching and you'll find something sketchy on any of the platforms.</span></p>\n<p>I don't think Rogan needs to be \"deplatformed\" or \"canceled\" or whatever the boomers are alleging the kids call it these days. The government isn't — and certainly shouldn't — censor him. I know some people do think he should be. I think they're wrong, and anyway, it's not going to happen. That word gets thrown around a lot, but censorship is not people deciding to go somewhere else when you're talking. That's just them telling you you're not worth their time. Censorship requires a structure aimed at silencing particular points of view. If you don't get paid for your views, that's not censorship. I've got this whole blog no one's paying for. Millions of people do. Censorship also requires power asymmetry (power, money, access to control regulation, etc.) I can't google any results of weaker parties successfully censoring more powerful or dominant groups. Celebrities aren't censored by audiences who have grown tired of them.</p>\n<p>What people are attempting is a boycott, which is actually just more free speech. Neil Young wanted Spotify to choose between his music and Rogan's podcasts after <a href=\"https://spotifyopenletter.wordpress.com/2022/01/10/an-open-letter-to-spotify/\">an open letter</a> to Spotify, signed by hundreds of doctors, asked the platform to implement a misinformation policy following Rogan's show featured a guest promoting various anti-vaccine conspiracies. It's not the only time that's happened. Spotify, in response, removed Young's music. So that's its misinformation policy.</p>\n<p>It's important (central, even) to this story that Spotify bought exclusive rights to Rogan's show, and made this choice. It indicates that Rogan's content is part of Spotify's business model. A $100 million bet that a show that occasionally dabbles paranoid conspiracies that put people off life-saving vaccines is not an accident. This comes after another piece of weird news in which Spotify paid $30 million to royal exiles Harry and Meg for a show <a href=\"https://www.news.com.au/entertainment/celebrity-life/royals/spotify-steps-in-to-bolster-meghan-and-harrys-multimilliondollar-podcast/news-story/550810c42d28be3d8f486e1433243574\" title=\"I would not make a podcast for half that amount.\" rel=\"nofollow\">they subsequently never made</a>. And all this spending resurfaced the fact that Spotify <a href=\"https://en.wikipedia.org/wiki/Criticism_of_Spotify#Allegations_of_unfair_artist_compensation\" target=\"_blank\" rel=\"noopener noreferrer\">pays most artists horribly</a>, <a href=\"https://variety.com/2021/digital/news/spotify-comedy-royalties-faceoff-1235135127/\">wiped a bunch of content of comedians</a> who complained they hadn't been paid, and essentially just being a shitty business <a href=\"https://www.barrons.com/articles/spotify-has-finally-found-a-profitable-tune-51635346820\" target=\"_blank\" rel=\"noopener noreferrer\">that's only managed to show a profit in September</a> due to its ad revenues.</p>\n<p>So, considering the investment in douche podcasters, treating the majority of content creators horribly, I decided I didn't need to pay into that. And since I was only paying to not hear the ads, I've got no use case for Spotify. <strong><span style=\"text-decoration: underline;\">So importantly, boycotters: It's not enough to stop your subscriptions. If you want things to hit Spotify's wallet you need to close your account.</span> </strong>Spotify avoided being in the red by the skin of its teeth and it was due to ads, not your subscriptions, and that's based on accounts and their activity. That's not censorship. Consider all the things you didn't listen to today. All those radio shows you missed, all those dramas you didn't watch because you didn't have the time or they looked stupid. You didn't censor any of them.</p>\n<p>That's the good news. Now here's the bad news: The streaming industry sucks. Aside from <a href=\"https://bandcamp.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Bandcamp</a>, which is limited, there are no real good actors out there. So, you're still going to find on lots of them the horrible payment schemes, the bad podcasters and the ravenous, destructive, snake-eating-its-tale capitalism. That's because the music industry is itself awful, a subset of the exploitative entertainment industry. You can decide to boycott it all, but that may get kind of a grim, and it just means the people who may not be getting paid their worth are making even less.</p>\n<p>So choose, but as DJ Gandalf says, choose wisely. Maybe pick a service that's not spending millions of dollars for exclusive rights to elevate hateful trolls and flat-earthers. Just remember that their existence is a whack-a-mole problem that spans all platforms of any decent size, and the mitigation needed is in education and better access to good information, and the sorts of social investment that don't create nihilistic hordes braying for an apocalypse that would be preferable to their wretched, vacuous existence and so are prime to believe anyone willing to tell them that sweet, sweet doom is finally happening. Carpet baggers are nothing new, and they've always known how to make a buck. The best you can hope for is a platform not going out of its way to turn them into multi-millionaires.</p>\n<p>And now here's more bad news: We gave our freedom away, or let it be dragged away. And I'm talking about file formats, interpretability, the right to copy your own media and use it anywhere you want. While everyone's chirping their happiness of switching to Apple Music, the voice in the back of my head still holds Apple more than a little responsible for this mess. When it went down the DRM route in iTunes, it was a step towards the streaming world. Along the way we lost mixtapes and burned CDs or MP3s that could be moved from this to that device regardless of who made it or what software it's running.</p>\n<p>The first format I bought with my own money was vinyl. I think I was in the 5th grade give or take a year, I had a couple of dollars at a garage sale up the road from home and picked up Janis Joplin's \"Cheap Thrills.\" Had no idea what was going in in that, just taken by the Robert Crumb cover art., but obviously someone bought the album, and now was being resold. My sister and I still debate who's album that one actually belonged to, but it was mine. The thing about records is that they're not terribly portable.</p>\n<p>File format evolution has been about shrinking things and making them portable. Vinyl was good for visual artists, and as formats got smaller they lost out, until most people were just looking at thumbnail images. During that transition, there was a brief, sweet spot for music fans between cassette tapes and burnable CDs, and then the early file sharing. But then the more copiable and digitised and intangible music became, more musicians started losing out. There's a whole history in this period on battles over intellectual property, copyright reform, <a href=\"https://en.wikipedia.org/wiki/Pirate_Party\" target=\"_blank\" rel=\"noopener noreferrer\">even a political movement I was keen on for a while</a>. Some good ideas started fermenting around that time and still exist, such as <a href=\"https://creativecommons.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Creative Commons</a>. But it taught the music industry new tricks. Criminalise uncontrolled file sharing and lower the cost barriers of file access, and also don't really still give that much cash back to content creators. Shrinking things has profit. Portability, not so much. Now the industry isn't even about purchasing the music files, just accessing them in lease contracts on specific apps in which whenever you complete a track some lucky performer somewhere you'll never pay to see live because of a pandemic will get $0.0033. Meanwhile, profits the platform suck in from your $10 per month will help it throw bags of cash at of some fuckwit you never listen to whose only skill is preying on the simple minded and the angry.</p>\n<p>So, I'll probably make another Faustian bargain on some other service. You won't hear which one it is until I quit that one too, though. I'll give one free advertising when there's a good creator controlled service.</p>\n<p><strong>&gt; Find more random thoughts on all this <a href=\"https://treacherous.tech/some-more-notes-on-the-spotify-kerfuffle.html\">here</a>.</strong></p>",
            "image": "https://treacherous.tech/media/posts/18/Time-coded_vinyl_record.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/encryption-is-not-a-crime-its-a-deterrence.html",
            "url": "https://treacherous.tech/encryption-is-not-a-crime-its-a-deterrence.html",
            "title": "Encryption is not a crime, it&#x27;s a deterrence",
            "summary": "In which, for reasons unknown, the British government tries once again to make a villain out of a technological function that makes everyone safer online. Tl;dr: Lots of things break and nothing in the stated goal is achieved. UPDATE&hellip;",
            "content_html": "<p class=\"msg msg--highlight  msg--warning\"><strong>In which, for reasons unknown, the British government tries once again to make a villain out of a technological function that makes everyone safer online.</strong></p>\n<p><strong>Tl;dr: Lots of things break and nothing in the stated goal is achieved.</strong></p>\n<hr>\n<p><strong>UPDATE (21/01/2022):</strong> UK data watchdog, The Information Commissioner’s Office, agrees with me <a href=\"https://www.theguardian.com/technology/2022/jan/21/end-to-end-encryption-protects-children-says-uk-information-watchdog\" target=\"_blank\" rel=\"noopener noreferrer\">that properly implemented end-to-end encryption keeps kids safer online</a>.</p>\n<hr>\n<p>The UK Home Office <a href=\"https://www.wired.co.uk/article/uk-encryption-facebook-home-office-nspcc\" target=\"_blank\" rel=\"noopener noreferrer\">is back on its anti-encryption campaign</a>. This time it's with an costly and fairly lewd (more on that shortly) public relations blitz aimed at reframing an important but usually invisible security configuration as something akin to a pervy booth at the back of a nude dancing club instead of, say, the function that keeps your banking details, medical records, important business and personal communications confined to just those you think should see them.</p>\n<p>In this instalment of the Very British Crypto Wars, Priti Patel's team has signed a £534,000 contract with advertising firm M&amp;C Saatchi to reframe backdooring your security away from being a privacy or security concern to make it \"about the children\" and the notion that encryption is keeping police from tackling child exploitation online. This is also <a href=\"https://www.bbc.co.uk/news/business-57050689\" target=\"_blank\" rel=\"noopener noreferrer\">not the first time to use fly that flag</a>. The Home Office is also working with longtime alley in this battle, the still very misguided NSPCC, which still campaigns that children will be safer only if their communications are some how easer to exploit by adults unknown.</p>\n<p>This is a marketing campaign aimed at turning public opinion on a topic that there's very little knowledge about. Wouldn't be the first time. Aside from a blitzkrieg of propaganda in various tabloids and a “partnership” with The Sun to really ramp things up with Conservatives favourite demographic, and one weird, slightly creepy PR stunt.</p>\n<p>According to<a href=\"https://www.independent.co.uk/tech/government-encryption-whatsapp-phone-security-b1994758.html\" target=\"_blank\" rel=\"noopener noreferrer\"> leaked documents on all this</a>, M&amp;C Saatchi notes that “'most of the public have never heard' of end-to-end encryption, one presentation slide about the campaign states – “people can be easily swayed” on the issue.\" To that end, they recommend going for the ick factor, getting people to not think about privacy and just go for feeling repulsed in a more fact-free environment. And here's where it gets weird. The stunt will be to place a glass box somewhere in public, a high street or shopping mall or some such place, one supposes. In the glass box, The Home Office, with the blessing of an NSPCC and some other charities aimed around children's issues, will pay a child to be locked in the box with an adult male who will leer sexually at them.</p>\n<blockquote>\n<p>“Inside the box, there are two actors; one child and one adult. Both strangers. The child sits playing on their smart phone. At the other end of the box, we see an adult sat on a chair also on their phone, typing away. ... The adult occasionally looks over at the child, knowingly. Intermittently through the day, the ‘privacy glass’ will turn on and the previously transparent glass box will become opaque. Passers by won’t be able to see what’s happening inside. In other words, we create a sense of unease by hiding what the child and adult are doing online when their interaction can’t be seen.”</p>\n</blockquote>\n<p>First, yuck. It sounds like something PETA would do, like when they hire a model to sit naked in a cage in an attempt to make people consider going vegan. Only it's worse, and involves a minor. It also makes you wonder what showbiz parent will think that's a good career move for their tween: Go sit in public somewhere while a strange guy you're confined with ogles at you for the day. For people who try to position themselves as interested in child protection, they have a strange way of showing it.</p>\n<p>There are lots of reasons a flailing government might want to detract from all its current scandals by looking for new boo scaries everywhere, and <a href=\"https://www.bbc.co.uk/news/59964656\" target=\"_blank\" rel=\"noopener noreferrer\">this campaign isn't doing that well</a>. But let's stick to the main point it's trying to make: child safety. So here it goes: <strong>Encryption keeps children safe.</strong> (note: it's not an age thing, it works the same for everyone). It keeps them safe when transmitting data on whatever network they need to access to use it. Keeps their communications from being profiled by myriad trackers that exist in the surveillance capitalist economy. The Home Office doesn't like <a href=\"https://www.apple.com/uk/privacy/features/\" target=\"_blank\" rel=\"noopener noreferrer\">Apple's implementation</a>. Who else doesn't? Third party data traders. Encrypted services mean when you call or text your child, there's a chance that stays between your family, like when you talk with them at home. Many families use WhatsApp, which does have strong encryption. They should be using <a href=\"https://signal.org/\">Signal</a>: Strong encryption and a lot of other features to make sure your offspring's data isn't where it shouldn't be. Use it for your family while you can still get it in this country.</p>\n<p>The Plague Times have led to more than one school lockdown, when we had to suddenly share are WFH lives across the kitchen table with one or more children trying to navigate classes via a series of Zoom or Teams calls with their classes and doing homework via a number of SaaS platforms. A lot of us manage their clubs memberships, school fees, schedules, teacher reports and social  through websites with questionable user interface choices. One thing you want on your device and in those platforms carrying all that data is strong encryption. I'll take a wonky interface if I'm fairly certain my kid's itinerary isn't being captured mid-way through transmission across the series of connections that make up how communication networks work.</p>\n<p>Back-dooring encryption, or policy to weaknesses in it won't work for a number of reasons, it would make things worse and require a rabbit's warren of other dystopian policy choises. You'd also need to legislate a national internet and close access to foreign services that won't subject themselves to local laws, and legislate against tools such as VPNs. You'd need to organise a system for storing master-keys and accessing them in ways that won't be compromised by insider threats or foreign governments. And lots and lots of blocking. Like the blocking that should be keeping me from watching the show I'm watching right now because I don't subscribe to that service (hypothetically speaking).</p>\n<p>There are other places where governments try to ban privacy and instil this idea of \"#NoPlaceToHide\". You don't want to live in them. Some people go to great lengths to leave them and get asylum somewhere else. As much as Priti Patel attacks encryption, she likes to have a go at them, too... particularly when they're at sea.</p>\n<p>There are a lot of ways to increase protection of children, all of which this government doesn't want to do. Increase spending on social services, access to good information, better education, and all the things for which this Tory government has cut funding. Incorporate targeted content across something like the BBC, whose funding this government is also working on freezing. Fund better investigative policing tools and teams, which this government also doesn't want to do. Tax big corporations, inclusive of the tech giants utilising strong encryption, to fund these and many other things instead of continuing to let them dodge it. Facebook (Meta) will happily fight a government about encryption so long as it doesn't have to face it over taxes.</p>\n<p>So, there are a lot of solutions to the stated problem. The point of weakening or creating backdoors to encrypted systems isn't about safety, it's about what it's always been about; it's about control.</p>\n<hr>\n<h3>More on this</h3>\n<ul>\n<li><a href=\"https://neilzone.co.uk/2022/01/a-prohibition-on-end-to-end-encryption-could-leave-you-with-noplacetohide-and-thats-not-a-good-thing\" target=\"_blank\" rel=\"noopener noreferrer\">A prohibition on end to end encryption could leave you with #NoPlaceToHide. And that's not a good thing.</a> = a list of ways this policy leads to bad things by Internet, telecoms and tech lawyer Neil Brown</li>\n<li><a href=\"https://alecmuffett.com/article/15742\" target=\"_blank\" rel=\"noopener noreferrer\">Why we need #EndToEndEncryption and why it’s essential for our safety, our children’s safety, and for everyone’s future #noplacetohide</a>. Many good reasons by security engineer Alec Muffett </li>\n<li><a href=\"https://www.openrightsgroup.org/campaign/save-encryption/\" target=\"_blank\" rel=\"noopener noreferrer\">Save Encryption</a>. Updates on the situation by Open Rights Group.</li>\n</ul>",
            "image": "https://treacherous.tech/media/posts/17/keys-261412860438709cZV.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "encryption"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/happy-2022-quit-more.html",
            "url": "https://treacherous.tech/happy-2022-quit-more.html",
            "title": "Happy 2022: Quit more",
            "summary": "Happy new year. It's a new year and I somehow feel obligated to make a blog post to mark that even though I kind of have writer's block and can't think of anything to write about. Fortunately, this is&hellip;",
            "content_html": "<p class=\"dropcap\">Happy new year. It's a new year and I somehow feel obligated to make a blog post to mark that even though I kind of have writer's block and can't think of anything to write about. Fortunately, this is a blog, and doesn't really have to be about much anything.</p>\n<p>It's around this time of year I like to take stock of my online presence and various hard drives and see what to keep, delete, or wipe and repeat. One of the nice things about using a password manager and app-based 2FA is that you can keep a nice running list of all the online accounts you've got. <a href=\"https://keepassxc.org/\" target=\"_blank\" rel=\"noopener noreferrer\">KeePassXC</a> tells me how many hundreds of accounts I have floating around. If you want to both strengthen your use of passwords and start and audit of all the places you have an account, set up a password manager, and as you use each account, reset the password to some random 32+ character monster you'll never remember, and keep a record of where you're going online at the same time. The best way to start with a password manager is to just set one up and go. Instead of trying to add all your accounts in one go (if you have a lot of them) just add them as you visit the websites. In about a month, you'll have the majority (if not all) of your important accounts. So there's a new year's PSA for you.</p>\n<h3>The website</h3>\n<p>I'm temporarily closing some buggy things. Closed the onion mirror of this blog and the onionshare contact form for a bit until I can make these things more stable. Will also be looking for a flat-site generator to replace Publii, which started strong, but the bugs are becoming kind of annoying. It edits kind of wonky. Select text to delete and it deletes the paragraph above. Weird. </p>\n<h3>Online accounts</h3>\n<p><strong>Delete: </strong>Amongst many things, Slack. A few years ago I went from 0 to 8 Slacks in just a couple of months, and I currently use 1 of them, and not even that frequently. The one I controlled was easy. As an administrator, I just deleted it. But depending on the version of Slack being used, you may or may not be able to simply opt out. To remove myself from some, I need to contact the administrator. On at least one, I'm sure they've gone AWOL. You shouldn't have to talk to anyone to remove yourself from an online service. Slack was supposed to put an end to emails. It just created a deluge of meaningless chatter. No new Slacks. And need to post in existing ones I want out. </p>\n<p><strong>Keep:</strong> From the collection of digital collateral to roll on with, I'll stick with Publii, the app I'm using to make this blog. It's still glitchy and unfinished, and I can't yet justify using a premium version of it until they make this one work right, but it's maybe the best open source tool for throwing a simple, flat website on the web. Publii, Github and a reasonable domain management service are all that are running this show. The only thing I'm paying for is the domain.</p>\n<p><strong>Wipe and repeat</strong>: I keep some Protonmail addresses, and will even add one to the contact page here soonish. Unless you're also chatting with it using a Protonmail account as well, I don't particularly rate it as greatly enhancing security, and the spam/junk filtering is crap. I do regular wipes of the account though, and some people still want to send an email.</p>\n<h3>Socials</h3>\n<p>I quite Facebook a couple of years back, and have not really missed it. In fact, it immediately made checking in on the web better. Am still in the metaverse via Insta and WhatsApp, but single-use apps are where its at. Quit more social sites, or understand why you're on them. Actually, here I recommend <a href=\"https://twitter.com/anildash/status/1477313627598299137\" target=\"_blank\" rel=\"noopener noreferrer\">Anil Dash's resources</a> on how to wipe your social accounts for new years and new starts. I'm just about to check out a Glitch app on how to \"KonMari\" Twitter followers <a href=\"https://glitch.com/~tokimeki-unfollow\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>, and highly recommend the process. I usually do this manually, but am happy to see something that makes the process more interesting.</p>\n<h3>2022 digital resolutions</h3>\n<ul>\n<li><strong>Quit more.</strong> Close more accounts, and make my web more ephemeral. I tend to be a volatile user, but I create lots of accounts often just to see what the shiny looking thing does. My goal this year is to close more online things than I open. Quitting another one of the big companies is still on my list. I still have some Amazon and Google services running and would be happy to move off.</li>\n<li><strong>Blog more.</strong> I wrote maybe 6 things last year (no, I'm not counting). Blog shorter, care less about form and style and be a bit more creative and messy (if you can believe it). </li>\n<li><strong>Tech less.</strong> I've downsized my devices in the last couple of years, and could still do some more culling. Like everything else, each thing should be justifying its existence in the horde. </li>\n</ul>\n<p> </p>",
            "image": "https://treacherous.tech/media/posts/16/uhffszjrfec51.webp",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        },
        {
            "id": "https://treacherous.tech/this-site-is-basically-always-a-test-site.html",
            "url": "https://treacherous.tech/this-site-is-basically-always-a-test-site.html",
            "title": "This site is basically always a test site... now here&#x27;s some AI generated images",
            "summary": "I broke the git workflow again. It's pretty easy to do. So I think I fixed it, and I'm testing it out. Here's some AI generated wombo.art made based on some text I typed into it. Did I make&hellip;",
            "content_html": "<p>I broke the git workflow again. It's pretty easy to do. So I think I fixed it, and I'm testing it out. Here's some AI generated <a href=\"https://app.wombo.art/\">wombo.art</a> made based on some text I typed into it. Did I make the art, or a machine, or some mechanical turks toiling away somewhere for pennies? Can I turn them into NFTs? What's the creator control in this (not considering ToS for the time being). From where comes the actual source material, and how much is sampled? I sense a big growth in all this and also many, many legal battles.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/Brexit_TradingCard.jpg\" data-size=\"939x1516\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/Brexit_TradingCard-thumbnail.jpg\" alt=\"Brexit\" width=\"720\" height=\"1162\"></a>\n<figcaption>Boris Johnson eating gammon in a field of red poppies</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/eye_cell_TradingCard.jpg\" data-size=\"936x1508\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/eye_cell_TradingCard-thumbnail.jpg\" alt=\"Too many eyes watching in prison\" width=\"720\" height=\"1160\"></a>\n<figcaption>Eye Cell</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/source_meeting.jpg\" data-size=\"938x1524\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/source_meeting-thumbnail.jpg\" alt=\"Source Meeting\" width=\"720\" height=\"1170\"></a>\n<figcaption>A meeting in the rain to exchange documents in autumn</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/The_hunger.jpg\" data-size=\"939x1507\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/The_hunger-thumbnail.jpg\" alt=\"The hunger\" width=\"720\" height=\"1156\"></a>\n<figcaption>Carnivorous rabbits in a humid jungle at night</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/the_pirates_TradingCard.jpg\" data-size=\"941x1520\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/the_pirates_TradingCard-thumbnail.jpg\" alt=\"The Pirates\" width=\"720\" height=\"1163\"></a>\n<figcaption>Pirates fighting business men at sea</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/The_source_TradingCard.jpg\" data-size=\"928x1516\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/The_source_TradingCard-thumbnail.jpg\" alt=\"The Source\" width=\"720\" height=\"1176\"></a>\n<figcaption>A source encrypting files for a journalist</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://treacherous.tech/media/posts/15/gallery/umbrella_TradingCard.jpg\" data-size=\"929x1511\"><img loading=\"lazy\" src=\"https://treacherous.tech/media/posts/15/gallery/umbrella_TradingCard-thumbnail.jpg\" alt=\"Umbrella\" width=\"720\" height=\"1171\"></a>\n<figcaption>umbrella under a street lamp</figcaption>\n</figure>\n</div></div>",
            "image": "https://treacherous.tech/media/posts/15/The_source_TradingCard.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "meta"
            ],
            "date_published": "2022-11-28T21:39:28+00:00",
            "date_modified": "2022-11-28T21:39:28+00:00"
        }
    ]
}
