{
    "version": "https://jsonfeed.org/version/1",
    "title": "treacherous.tech",
    "description": "",
    "home_page_url": "https://treacherous.tech",
    "feed_url": "https://treacherous.tech/feed.json",
    "user_comment": "",
    "author": {
        "name": "Yours Truly"
    },
    "items": [
        {
            "id": "https://treacherous.tech/this-is-how-they-tell-me-the-world-ends.html",
            "url": "https://treacherous.tech/this-is-how-they-tell-me-the-world-ends.html",
            "title": "Reading: &#x27;This is How They Tell Me The World Ends&#x27;",
            "summary": " I'm only early pages into \"This is How They Tell Me the World Ends\", a readable tour through the quickly escalating cyber war between states and sometimes non-state groups, by New York Times journalist Nicole Perlroth, and will&hellip;",
            "content_html": "\n  <p>\n    I'm only early pages into \"<a href=\"https://www.goodreads.com/book/show/49247043-this-is-how-they-tell-me-the-world-ends\" target=\"_blank\">This is How They Tell Me the World Ends</a>\", a readable tour through the quickly escalating cyber war between states and sometimes non-state groups, by New York Times journalist Nicole Perlroth, and will update this post later with a full review. But highly recommend it if you want to read along with me.\n  </p>\n\n  <p>\n    What it's got going for it: It's readable and fast paced and Perlroth has a good narrative voice and also makes for a good central character navigating from one technology nightmare to the next for the NYT. She's good at avoiding the technical jargon where it's not needed and explaining it where it's unavoidable. I think her short-cuts to educating readers on what are sometimes really complicated topics will be like fingernails on a chalkboard to experts in cyber security fields, but this book isn't aimed at that audience, and so far her descriptions are at least hitting the dartboard if not always the bullseye.\n  </p>\n\n  <p>\n    There's <a href=\"http://addxorrol.blogspot.com/2021/02/book-review-this-is-how-they-tell-me.html\" target=\"_blank\">a very in-depth review of the book here</a>, but don't let it put you off if you're generally interested in how the U.S., Russia, China along with other countries and a growing cast of non-state groups are taking aim at power grids, telecommunications services and anything that keeps a nation running, all of it, more or less, managed over the same internet you're using to read these words.\n  </p>\n\n    <h3 id=\"the-good-bits-so-far\">\n      The good bits so far\n    </h3>\n\n  <ul>\n    <li>It's got a good voice, tone and pace. Perlroth makes for a good character to hold the chapters together, and it's kind of useful for the reader that she's not coming from anything related to a cyber security background.</li><li>There's a lot of inside baseball about the New York Times and how it operates on these kinds of stories, and how it plays well, or doesn't play well, with others. the book starts off with her involvement in reporting on the Snowden leaks of NSA programs, and there's no shortage of snark about The Guardian.</li><li>To be honest, if the book can make a general audience more interested in these kinds of issues, then I think that's a good thing overall.</li>\n  </ul>\n\n    <h3 id=\"the-rough-bits\">\n      The rough bits\n    </h3>\n\n  <ul>\n    <li>I'd agree with the above linked review on a few things: Their's a really strong bias toward America being a bit too clean. I'd add that there's also too much of a bias that the NYT can do no wrong. She cites Glenn Greenwald and Edward Snowden's disgust with the Guardian for collaborating with the Times on the NSA files, noting Snowden still didn't trust the Times because it had sat on another story for nearly a year about NSA mass surveillance of phones. But she dismisses this as no reason to not trust the Times now. Why? That would be a perfect reason to not trust it. (Greenwald should have still acted like an ass, though, in holding back files, which essentially is pretty hypocritical given the reason why he did it).</li><li>There is too much of a focus on 0-day exploits. These are bugs in a system that no one new existed. Hackers finding these have immediate and often damaging access. These do exist and are problematic, but they're also not the most common problem. The most common problem is that a lot of systems managing important, life-impacting infrastructure, is built on flawed, poorly designed systems and often these systems aren't even updated to have the security patches that exist. Often hackers don't need 0-days, just time to find the holes that are known. Just two out of too many examples to list:</li><ul><li><a href=\"https://en.wikipedia.org/wiki/WannaCry_ransomware_attack\" target=\"_blank\">The cyber attack on the NHS </a>didn't need a 0-day exploit, just old versions of Windows and an easily tricked member of staff.</li><li><a href=\"https://krebsonsecurity.com/2021/02/whats-most-interesting-about-the-florida-water-system-hack-that-we-heard-about-it-at-all/\" target=\"_blank\">The Florida water systems hack</a>&nbsp;didn't need a 0-day exploit. The hacker found an insecure web page with settings that allowed them to change acidity levels in the water treatment to lethal levels (thankfully someone was paying attention when it happened).</li></ul>\n  </ul>\n\n  <p>\n    It's interesting that the book has a<a href=\"https://bookshop.org/books/this-is-how-they-tell-me-the-world-ends-the-cyberweapons-arms-race/9781635576054\" target=\"_blank\">lready been optioned for film or television treatment</a>. Good for her, I say, take the money and run. I'm a bit concerned that it will turn out to be something like \"Homeland\" but for the cybers, and so, you know, awful. But thus far the book is a readable, guided tour through the complex systems that are growing more fragile and hard to control and yet more responsible for not wiping a lot of us out in one go. Enjoy.\n  </p>",
            "image": "https://treacherous.tech/media/posts/7/this-is-how.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "books"
            ],
            "date_published": "2021-02-25T21:18:43+00:00",
            "date_modified": "2021-02-25T21:18:43+00:00"
        },
        {
            "id": "https://treacherous.tech/bypassing-online-censorship.html",
            "url": "https://treacherous.tech/bypassing-online-censorship.html",
            "title": "A little resource on bypassing online censorship",
            "summary": " Started a small resource page for people on how to deal with internet shutdowns that I'm calling The Detour.&nbsp; Shutdowns been in the news over the last week following the military coup in Myanmar, and the shutdown that&hellip;",
            "content_html": "\n  <p>\n    Started a small resource page for people on how to deal with internet shutdowns that I'm calling <a href=\"https://listed.to/@the_detour\" target=\"_blank\">The Detour</a>.&nbsp;\n  </p>\n\n  <p>\n    Shutdowns been in the news over the last week following the military coup in Myanmar, and the shutdown that happened there, and threats of it happening again in Iran. internet shutdowns are on the rise, and have long been a tool by regimes to stop organising happening internally or news getting out.&nbsp; <a href=\"https://www.hrw.org/world-report/2020/country-chapters/global-5\" target=\"_blank\">internet Shutdowns are on the rise</a>. We've already seen it happen in 2021. [In 2019]. In 2020 there were <a href=\"https://www.hrw.org/world-report/2020/country-chapters/global-5\" target=\"_blank\">83 documented shutdowns</a> in the world. A bit down from the <a href=\"https://www.accessnow.org/cms/assets/uploads/2020/02/KeepItOn-2019-report-1.pdf\" target=\"_blank\">213 shutdowns that happened in in 2019</a>, but still on the upward trajectory. There were 33 in 2018 and 25 the year before that.\n  </p>\n\n  <p>\n    I'll be moving on to include some resources on other kinds of internet censorship and how to work around it. The goal overall is to keep it end-user focused, though may add a post on the bigger, more involved projects. The other goal is to experiment with a pretty easy and sturdy way of publishing on the web.\n  </p>\n\n    <h3 id=\"what-the-detour-is-made-with\">\n      What 'The Detour' is made with...\n    </h3>\n\n  <p>\n    As I've noted in earlier posts on this blog, I'm interested in simple, sturdy and secure ways to publish online. Sites that don't need databases or login credentials. Site's with minimal code bases to maintain. I'm publishing this site using Publii and Github pages. The work happens through an app on my computer and then spits pages at a site hosted on Github. So The Detour is an experiment along these lines.\n  </p>\n\n  <p>\n    I'm a <a href=\"https://standardnotes.org/\" target=\"_blank\">Standard Notes</a> user. It's an extendable, open source text editor that's good for taking quick notes, editing, and storing information. It's open source, and can sync across devices and back-up in the cloud of your choice with strong encryption. I&nbsp;recently noticed that it has a simple blogging function that publishes on&nbsp;<a href=\"https://listed.to/\" target=\"_blank\">Listed.to</a>.&nbsp;\n  </p>\n\n  <p>\n    It's not an incredibly sophisticated publishing tool, but really easy for anyone to start, and the model is incredibly attractive if you wanted to extend it to a small team who could submit, review edit and publish using Standard Notes already existing encrypted sharing functions. It's much better than leaving unfinished drafts on a public website, or having to keep persistent connections to a web server while doing the research, writing and editing.\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://treacherous.tech/media/posts/6/detour.png",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "circumvention"
            ],
            "date_published": "2021-02-25T21:18:43+00:00",
            "date_modified": "2021-02-25T21:18:43+00:00"
        },
        {
            "id": "https://treacherous.tech/time-to-read.html",
            "url": "https://treacherous.tech/time-to-read.html",
            "title": "Time to read",
            "summary": " I used to have this mental game, back in the before times. On the packed overground train in the morning, when commuters are stuffed tight against one another with no room to breath, I'd imagine the space if&hellip;",
            "content_html": "\n  <p>\n    I used to have this mental game, back in the before times. On the packed overground train in the morning, when commuters are stuffed tight against one another with no room to breath, I'd imagine the space if it only contained one tenth the population, randomly pick 9 out of 10 to not exist and think what that commute might be like. I don't have to imagine that anymore. Taking the train on average once a month now, seeing 5 or fewer fellow commuters, wearing their masks, sitting apart from one another, still stuck in their minds like we all had been before.\n  </p>\n\n  <p>\n    There's room to sit on the train and read now. But no where to go.\n  </p>",
            "image": "https://treacherous.tech/media/posts/5/time-to-read.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "life "
            ],
            "date_published": "2021-02-25T21:18:43+00:00",
            "date_modified": "2021-02-25T21:18:43+00:00"
        },
        {
            "id": "https://treacherous.tech/the-regime-that-the-internet-created.html",
            "url": "https://treacherous.tech/the-regime-that-the-internet-created.html",
            "title": "The regime that the internet created",
            "summary": " Howard Dean was the first American political candidate to use the internet as a vehicle to run a campaign. And his team was on to something. In 2002 his team working on the Democratic nomination for the 2004&hellip;",
            "content_html": "\n  <p>\n    Howard Dean was the first American political candidate to use the internet as a vehicle to run a campaign. And his team was on to something. In 2002 his team working on the Democratic nomination for the 2004 presidential election was pioneering the things that are all now bog-standard: campaign website, online donation pages and blogs. He also realised the purpose behind it all: You convert people into communities, not voters. Votes are a bi-product of generating communities. And people want to believe. Meetup.com was new, and the campaign used it to get people to throw house parties, or find groups to hang out with at the local <em>TGI Fridays</em> or whatever. The whole thing was geared toward meeting, bonding and agreeing with one another. Fun. It didn't work in the end. But it was a first iteration. Every major political campaign since built on the model, and there's now no such thing as a successful campaign that can't find its roots in it.\n  </p>\n\n  <p>\n    You could plot a course from Dean's use of nascent social media to how it had been used to span a beyond-control horde of MAGAheads storming the capitol 18 years later.&nbsp;\n  </p>\n\n  <p>\n    <a href=\"https://en.wikipedia.org/wiki/Christopher_Wylie\" target=\"_blank\">Chris Wiley's</a> book <em>Mindf*ck</em> plots the data scraping consultant's career exploiting demographic data and the social web to micro-target voters based on personas, starting with the Liberal Party in Canada before taking his trade to the Obama campaign and then on to the Liberal Democrats in UK before helping out both the UK referendum to quit the EU and the campaign to elect Donald Trump in the U.S. The supply chain of tactics is clear here, from friendly liberal Canadians to resurgent proto-fascist movements in the span of a decade or less.&nbsp;\n  </p>\n\n  <p>\n    People like to call&nbsp;<a href=\"https://en.wikipedia.org/wiki/Aaron_Swartz\">Aaron Swartz</a> \"The Internet's Own Boy.\" It's a good story. He was instrumental in a lot of things that have made the internet useful, educational, fun and open. At least the parts of the internet that are those things. And he was prosecuted and endlessly hounded for it. We can call the 45th president's single term the internet's own regime. It used the same tools, created communities, leveraged social media data to target messaging, and all together hit a nerve. So when people talk to you about the marvels of the internet age, sure it's pretty cool. We've created awesome ways for people to connect, work and socialise. And not an insignificant number of them can be instigated to use those tools to try to destroy democracy sometimes. This iteration failed.\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://treacherous.tech/media/posts/4/atlantic-abomination.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "politics"
            ],
            "date_published": "2021-02-25T21:18:43+00:00",
            "date_modified": "2021-02-25T21:18:43+00:00"
        },
        {
            "id": "https://treacherous.tech/new-year-new-blog.html",
            "url": "https://treacherous.tech/new-year-new-blog.html",
            "title": "New year; new blog",
            "summary": "Hello friend, Happy 2021 and thanks for keeping up with the ever evolving progression of this experiment. 2020 was the dumpster fire that gave more flame than than anyone could have expected, or would have asked for. Toward the&hellip;",
            "content_html": "<p>Hello friend,</p>\n<p>Happy 2021 and thanks for keeping up with the ever evolving progression of this experiment. 2020 was the dumpster fire that gave more flame than than anyone could have expected, or would have asked for. Toward the end of 2019, I'd ditched <a href=\"https://wordpress.org\" target=\"_blank\" rel=\"noopener noreferrer\">Wordpress</a> for <a href=\"https://gohugo.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Hugo</a> and went on to created all of 3 blog posts. It was an exhausting year. Working on other people's problems was more than enough. I mostly ignored my own. </p>\n<p>This year, I'm starting with <a href=\"#INTERNAL_LINK#/post/null\" target=\"_blank\" rel=\"noopener noreferrer\">Publii</a>, which is an open source app that generates flat-sites. It's part of my continuing search for website publishing systems that securely keep the back end (the place where people create the content) away from the front end (where people show the content), are light on the server, and easy on the user. Wordpress has become bloated and too much of an attack target. The CMS is borderline adware and the \"community\" of developers is becoming more of a flea market of poorly constructed design themes and plugins that are patchy, bloated and hackable.<a href=\"https://getpublii.com/\" title=\"publii\" target=\"_blank\" rel=\"noopener noreferrer\"></a></p>\n<p>Hugo was all right. Create and edit posts in a text file and then with a few commands new content is up on the website. It's easy to secure, can run blazingly fast websites and be hosted nearly anywhere, lowering costs amazingly. Ticked a lot of my static-site requirements. Except one. It isn't for end users, or at least how I define them. An end user is someone who wants to open an app, type their content, hit save or publish and see it on the site. Wordpress does this, just horribly from every other point of view. But it's what people expect. Hugo, <a href=\"https://jekyllrb.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Jekyll</a>, <a href=\"https://scotch.io/tutorials/top-10-static-site-generators-in-2020#toc-1-gatsby\">Gatsby</a> and the like are for people who want to endlessly tinker with code and templates and refine their git workflows. They just move the complexities elsewhere.  So, I'm trying out Publii, which is in an app. It's doing a lot of things those other static site generators are doing, but the user doesn't need to see them or carry out each operation. It also opens with a wysiwyg editor that authors will expect, and somewhat obvious settings and configuration options. There seems to be not much of a developer or designer community to speak of, though.</p>\n<p>So like each time I do this, I start out minimal, and wipe what came before. I believe in the permeable web, the volatile one. The web that forgets. The non-centralised, federated services one. Sure, we need that archiving internet, the one with tracking and accountability for our governments, leaders (be they political, corporate, religious or social) and all these caches, backups and searchable systems that keep the receipts. For a lot of the rest of us, though, we need one that is more like a sand mandala. Something that gives us the privacy, security, and most importantly, the space to experiment and either maintain, iterate or wipe: no harm; no foul.</p>\n<p>Unfortunately, the inverse is more commonly the case. Kids say dumb things on Instagram and it chases them into the starts of their careers. Videos meant for one set of eyes get immortalised for all eyes for all time. Humans aren't designed for the web we have. It's not sense in blaming the user. It makes as much sense as blaming jellyfish for beaching themselves on the outgoing tide. The situation moves faster than our survival instincts. We should still be sitting somewhere in a savannah staring into the middle distance with an expression that implies more significant thought than what's really going on. Parts of our brains have developed a world that other parts of our brains can'd deal with. So cut yourself some slack. You aren't even supposed to be here today. None of us are.</p>\n<p>We're still calling the site Treacherous Tech, because the it still suits the overall point: The promises of a gloriously interconnected world of social media, IoT sex toys and door bells that can spy on the comings and goings in front of your house all come with ToS catches. There are stings attached, monetisation efforts and ever expanding threat surface. We inflict  all this on ourselves in order to have dopamine rushes from people clicking <span style=\"color: #e03e2d;\">♥️</span> on our selfies and to get garlic peelers on the same day we click the order button. Technology keeps its promises, so be sure you know what it's promising.</p>\n<p>But I digress.</p>\n<p>I already prefer the editing interface of publii. It's a little buggy and unfinished in parts. It feels more like a word processor than a CMS. I like that the drafts are mine, here on this local machine, before I publish them on some server somewhere, even in draft mode. I like that I don't need to launch the terminal and manually chug through git processes just to make each blog post. It's got a slightly wonky interface and I don't think all the buttons are labeled that well, and I think it could benefit from some usability love, but early days.</p>\n<p>I'm using the default theme this CMS comes with (there aren't many alternatives), so don't expect much on that front. I don't care much how it looks. It's just a thing to write into. A bit more FOSS and self-hosted than Medium. A bit less faff than a Wordpress or Drupal or Hugo site. I think it needs work, but it is definitely suitable for a single-person blog. It's kind of the slacker option.</p>\n<p>It's a new year, and I'm taking the easy route. There's enough going on with a pandemic, a Brexit, some chump in the White House who can't take a hint. Another year or so in doors. Go easy on yourself, too.</p>\n<p>Happy new year,</p>\n<p>Yours truly.</p>",
            "image": "https://treacherous.tech/media/posts/1/tumblr_p5hrv8fPab1skkfpco2_1280.jpg",
            "author": {
                "name": "Yours Truly"
            },
            "tags": [
                   "meta"
            ],
            "date_published": "2021-02-25T21:18:43+00:00",
            "date_modified": "2021-02-25T21:18:43+00:00"
        }
    ]
}
